from functools import lru_cache


EDUCATION_INSTITUTES = '''
אבן סינא
אגרוסטאדיס
אוגדת ישראל
אולפן משה שרת
אולפן עקיבא
אולפנה
אולפנת - נווה דקלים
אולפנת חלוצה
אור ברכה סמינר בית יעקב גור
אורות האר"י
אלח'וארמזי
בי"ס אזורי יובלי הנגב
בי"ס אילנות
בי"ס אקדמאי לסיעוד
בי"ס ארזים
בי"ס ארצי לכבאות והצלה
בי"ס בית יעקב לבנות
בי"ס גבוה לטכנולוגיה
בי"ס גיורא יוספטל
בי"ס הבינלאומי למלונאות ותיירות
בי"ס הדמוקרטי
בי"ס הלן קלר לעיוורים
בי"ס וטרינרי
בי"ס חט"ב +עליונה - מפתן
בי"ס חינוך מיוחד בלקינד
בי"ס חינוך מיוחד מ"מ צבר
בי"ס חינוך מיוחד שיקמים
בי"ס טכני חיל האוויר
בי"ס לאומנויות בצלאל
בי"ס לאחיות סלזיאניות
בי"ס לבנות הצנע לכת
בי"ס לבנות רמות פולין
בי"ס לגננות ושתלנות
בי"ס למוסיקה רימון
בי"ס למכינות הקדם אקדמאיות
בי"ס לעובדי הוראה בכירים
בי"ס לפגועי נפש בית אסי
בי"ס מ"מ דקלים
בי"ס מ"מ חינוך מיוחד אורים
בי"ס מ"מ חינוך מיוחד ע"ש הרצפלד
בי"ס מ"מ חינוך מיוחד עמל
בי"ס מ"מ מנחם בגין
בי"ס מ"מ נווה
בי"ס מ"מ עמי אסף
בי"ס מגן אברהם
בי"ס ממ"ד אלפסי למדעים
בי"ס ניסוי אפיקים
בי"ס שילה
בי"ס תורני החדש עוז והדר
ביה"ס - תיכון המושבה
ביה"ס יסודי - העמק הירוק
ביס עומר בן אלחטאב
בית אלחכמה/אאלקפזה
בית אמי"ת
בית אריאל מרכז למדעים
בית הלן קלר לטיפול בליקויי שמיעה
בית המדרש תולדות אברהם יצחק
בית הספר וכפר הנוער איילת השחר
בית חינוך בית אב"י
בית חינוך לבנות מאור ירושלים
בית חינוך לבנות מסילה בערבה
בית חינוך לעיוורים
בית ילדים נווה הרוא"ה
בית מדרש דחסיד צאנד
בית מדרש הרשב"י
בית ספר  אלעטאא ואדי
בית ספר  למנהיגות נוער
בית ספר -  מוריה ממ"ד כרמיאל
בית ספר - א אבן חלדון
בית ספר - א' אל מוסתקבל
בית ספר - אבו גוש
בית ספר - אבו גוש
בית ספר - אבו ח'לדון
בית ספר - אבו חוסיין
בית ספר - אבו עוביידה
בית ספר - אבי עזרי
בית ספר - אביב
בית ספר - אביב
בית ספר - אביבים
בית ספר - אביגדור
בית ספר - אביטל
בית ספר - אביעזרי
בית ספר - אביר יעקב
בית ספר - אביר יעקב
בית ספר - אבישור
בית ספר - אבן ח'לדון
בית ספר - אבן חלדון
בית ספר - אבן חלדון
בית ספר - אבן חן
בית ספר - אבן ישראל
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא
בית ספר - אבן סינא א
בית ספר - אבן סינא ב
בית ספר - אבן רושד
בית ספר - אבן רושד
בית ספר - אבן שוהם
בית ספר - אבן שמואל
בית ספר - אבני החושן
בית ספר - אג'יאל
בית ספר - אגרון
בית ספר - אגרת חיים
בית ספר - אדיר
בית ספר - אדיר לבנות
בית ספר - אהבת ישראל
בית ספר - אהבת ישראל בנים
בית ספר - אהבת משה
בית ספר - אהבת ציון
בית ספר - אהבת ציון
בית ספר - אהוד
בית ספר - אהוד מנור
בית ספר - אהוד מנור
בית ספר - אהל יוסף יצחק חב"ד
בית ספר - אהל שם
בית ספר - אהלי שמעון
בית ספר - אהרון דוידי
בית ספר - אהרון הרואה לבנים
בית ספר - אהרן הרא"ה לבנים
בית ספר - אוהל אשר
בית ספר - אוהל חיה
בית ספר - אוהל מאיר
בית ספר - אוהל שלום
בית ספר - אוהל שרה
בית ספר - אוהל תורה
בית ספר - אוהלי אברהם
בית ספר - אוהלי יוסף
בית ספר - אולפנא בני עקיבא
בית ספר - אולפנה יהודה
בית ספר - אולפנה לבנות מורן
בית ספר - אולפנה תורנית לבנות צביה
בית ספר - אולפנית ממ"ד המתמיד
בית ספר - אולפנת אורט אמונה
בית ספר - אולפנת המתמיד
בית ספר - אולפנת הראל
בית ספר - אולפנת השומרון אלקנה
בית ספר - אולפנת צביה
בית ספר - אולפנת צביה
בית ספר - אומרי דוד
בית ספר - און
בית ספר - אוסישקין
בית ספר - אוסישקין
בית ספר - אוסישקין
בית ספר - אופק
בית ספר - אופק
בית ספר - אופק
בית ספר - אופק
בית ספר - אופק
בית ספר - אופקים אזורי
בית ספר - אופקים חינוך מיוחד
בית ספר - אוצר החיים
בית ספר - אוצר החיים
בית ספר - אור אבנר
בית ספר - אור אבנר
בית ספר - אור ברמה
בית ספר - אור האמת
בית ספר - אור החיים
בית ספר - אור השחר
בית ספר - אור התורה
בית ספר - אור זבולון
בית ספר - אור זרוע
בית ספר - אור כפר האורנים
בית ספר - אור לטף
בית ספר - אור לציון
בית ספר - אור מאיר
בית ספר - אור מנחם
בית ספר - אור ע"ש זבולון המר
בית ספר - אור עולם
בית ספר - אור שלום
בית ספר - אור שלמה
בית ספר - אור תורה
בית ספר - אור תורה
בית ספר - אור תורה
בית ספר - אורות
בית ספר - אורות בנים
בית ספר - אורות התורה
בית ספר - אורות מודיעין
בית ספר - אורט
בית ספר - אורט
בית ספר - אורט
בית ספר - אורט
בית ספר - אורט
בית ספר - אורט
בית ספר - אורט אבין למדעים ואומנויות
בית ספר - אורט אוליינסקי
בית ספר - אורט אורמת
בית ספר - אורט אורן
בית ספר - אורט אפק
בית ספר - אורט בית אל
בית ספר - אורט גודמן
בית ספר - אורט גוטמן
בית ספר - אורט דפנה
בית ספר - אורט דרסקי
בית ספר - אורט חוץ השרון
בית ספר - אורט חצור
בית ספר - אורט מגדים
בית ספר - אורט סינגלובסקי
בית ספר - אורט עכו
בית ספר - אורט רונסון
בית ספר - אורט רמות
בית ספר - אורט שפירא
בית ספר - אוריין
בית ספר - אורים
בית ספר - אורן
בית ספר - אורנים
בית ספר - אורנים
בית ספר - אורנים
בית ספר - אורנים
בית ספר - אורתודוקסי
בית ספר - אורתודוקסי ערבי
בית ספר - אושיסקין תל"י
בית ספר - אזורי
בית ספר - אזורי
בית ספר - אזורי
בית ספר - אזורי
בית ספר - אזורי גדרה על שם מנחם בגין
בית ספר - אזורי גולן
בית ספר - אזורי הר וגיא
בית ספר - אזורי לאומניות ע"ש גולדברג
בית ספר - אזורי מבואות הנגב
בית ספר - אזורי ניצני הנגב
בית ספר - אזורי ניר צבי
בית ספר - אזורי ע"ש ד"ר חיים ויצמן
בית ספר - אזורי רימון
בית ספר - אזורי ש.ק.ד
בית ספר - אזורי שדות יואב
בית ספר - אזורית בית שאן
בית ספר - אחד העם
בית ספר - אחד העם
בית ספר - אחד העם
בית ספר - אחדות
בית ספר - אחדות ישראל
בית ספר - אחוה יפו
בית ספר - אחווה
בית ספר - אחווה
בית ספר - אחווה
בית ספר - אחווה
בית ספר - אחוות אחים
בית ספר - אחמדיה
בית ספר - איילת השחר
בית ספר - איילת השחר
בית ספר - איילת השחר
בית ספר - אילן רמון
בית ספר - אילנות
בית ספר - אילנות
בית ספר - אילנות
בית ספר - אינשטיין
בית ספר - איש מצליח
בית ספר - איש שלום
בית ספר - איתמר
בית ספר - איתמר
בית ספר - אל בוכארי
בית ספר - אל ג'זאלי
בית ספר - אל הוושלה
בית ספר - אל הוושלה ישן
בית ספר - אל הוזייל
בית ספר - אל ואטן
בית ספר - אל חואר
בית ספר - אל חווארנה
בית ספר - אל טורשן
בית ספר - אל מוטנבי
בית ספר - אל מותנאבי
בית ספר - אל נור
בית ספר - אל סייד א
בית ספר - אל סייד ב
בית ספר - אל סייד ג
בית ספר - אל סלאם
בית ספר - אל סלם
בית ספר - אל עמל
בית ספר - אל פרוק
בית ספר - אל רחמה
בית ספר - אל שאפעי
בית ספר - אלאח'א
בית ספר - אלאנדלוס
בית ספר - אלארזי
בית ספר - אלבסמה
בית ספר - אלג'זאלי
בית ספר - אלג'זאלי
בית ספר - אלדד
בית ספר - אלדד
בית ספר - אלהודא
בית ספר - אלומות
בית ספר - אלומות
בית ספר - אלומות
בית ספר - אלומות רחל
בית ספר - אלון
בית ספר - אלון
בית ספר - אלון
בית ספר - אלון
בית ספר - אלון
בית ספר - אלון למדעים
בית ספר - אלונים
בית ספר - אלונים
בית ספר - אלונים
בית ספר - אלופא
בית ספר - אלז'הרא
בית ספר - אלזהאא
בית ספר - אלזהרא
בית ספר - אלזהרא
בית ספר - אלזהרא
בית ספר - אלח'יאם
בית ספר - אלחיורזמי
בית ספר - אלחלאן
בית ספר - אלחריזי
בית ספר - אלי כהן
בית ספר - אלי שבע
בית ספר - אליאנס
בית ספר - אליאנס
בית ספר - אליעד
בית ספר - אליעזר בן יהודה
בית ספר - אלל סלאם
בית ספר - אלמוגים
בית ספר - אלמותנבי
בית ספר - אלמנאר
בית ספר - אלמנאר
בית ספר - אלמעאלי
בית ספר - אלנור
בית ספר - אלסלאם
בית ספר - אלספא
בית ספר - אלענן לתרבות
בית ספר - אלקאסמי
בית ספר - אלקנה
בית ספר - אלקנה
בית ספר - אלקנה
בית ספר - אלראשדיה
בית ספר - אלרחמה
בית ספר - אלרשדייה
בית ספר - אלשאפעי
בית ספר - אלשריף
בית ספר - אמ"ת
בית ספר - אמונים
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת
בית ספר - אמי"ת גוש דן
בית ספר - אמי"ת מרכז טכנולוגי דתי
בית ספר - אמי"ת נתיבי עם
בית ספר - אמי"ת ע"ש קנדי
בית ספר - אמי"ת פירסט
בית ספר - אמי"ת צפת בנות
בית ספר - אמי"ת צפת בנים
בית ספר - אמי"ת רננים
בית ספר - אמי"ת תורני מדעי
בית ספר - אמיר בנימיני
בית ספר - אמירה בסמה
בית ספר - אמירים
בית ספר - אמירים
בית ספר - אמירים
בית ספר - אמירים למדע ולסביבה
בית ספר - אמית
בית ספר - אמית אפיקים בנגב
בית ספר - אמרי בינה
בית ספר - אמת ושלום
בית ספר - אנג'אח
בית ספר - אנה פרנק
בית ספר - אנוך
בית ספר - אסיף
בית ספר - אפק
בית ספר - אפרים צמח
בית ספר - ארגנטינה
בית ספר - ארוממך
בית ספר - ארון ישראל
בית ספר - ארזים
בית ספר - ארזים
בית ספר - ארזים
בית ספר - ארלוזורוב
בית ספר - ארלוזורוב
בית ספר - ארן
בית ספר - אשכול
בית ספר - אשכול
בית ספר - אשכולות למדעים
בית ספר - אשל אברהם
בית ספר - אשלים
בית ספר - אשלים לתקשורת
בית ספר - אתרוג
בית ספר - ב
בית ספר - ב
בית ספר - ב
בית ספר - ב' גבעת זאב
בית ספר - ב"י אוהלי אליעזר
בית ספר - ב"י בית דוד חולון
בית ספר - ב"י מסורת ישראל
בית ספר - ב"י שערי אהרון
בית ספר - באר גנים
בית ספר - באר חיים
בית ספר - בארי
בית ספר - בארי
בית ספר - בבלי
בית ספר - בגין
בית ספר - בדרכי אמותינו
בית ספר - בורוכוב
בית ספר - ביאליק
בית ספר - ביאליק
בית ספר - ביאליק
בית ספר - ביאליק
בית ספר - ביאליק
בית ספר - ביאליק
בית ספר - ביכורה
בית ספר - ביל"ו
בית ספר - בין ההדרים
בית ספר - ביר אל מכסור
בית ספר - ביר אל מכסור
בית ספר - ביר אל מכסור ב
בית ספר - ביר אל מכסור ג
בית ספר - בית אליעזר
בית ספר - בית גדי
בית ספר - בית הכרם
בית ספר - בית וגן
בית ספר - בית זאב
בית ספר - בית חיה
בית ספר - בית חיה
בית ספר - בית חינוך
בית ספר - בית חינוך חרדי לבנות נווה הדסה
בית ספר - בית חינוך לבנות
בית ספר - בית חינוך צור יצחק
בית ספר - בית יהושע
בית ספר - בית יוסף
בית ספר - בית יוסף
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב
בית ספר - בית יעקב החדש
בית ספר - בית יעקב החסידי
בית ספר - בית יעקב החסידי
בית ספר - בית יעקב הישן
בית ספר - בית יעקב הרמה
בית ספר - בית יעקב לבנות
בית ספר - בית יעקב לבנות
בית ספר - בית יעקב לבנות משמרת מאיר
בית ספר - בית יעקב למורות וגננות
בית ספר - בית יעקב מרכז
בית ספר - בית יעקב נאות רחל
בית ספר - בית יעקוב
בית ספר - בית יעקוב לבנות
בית ספר - בית יצחק
בית ספר - בית מרגלים
בית ספר - בית מרגלית
בית ספר - בית מרגלית
בית ספר - בית עמוס
בית ספר - בית שלום
בית ספר - בית שלמה
בית ספר - בכור לוי
בית ספר - בליך
בית ספר - בלפור
בית ספר - במעלה
בית ספר - במעלה
בית ספר - בן איש חיל
בית ספר - בן אל ח'טאב
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון
בית ספר - בן גוריון השיטה
בית ספר - בן גוריון משולב אומנויות
בית ספר - בן צבי
בית ספר - בן צבי
בית ספר - בן צבי
בית ספר - בן צבי
בית ספר - בן צבי
בית ספר - בן צבי
בית ספר - בנות אור חיה
בית ספר - בנות אסתר
בית ספר - בנות יעקב לבנות
בית ספר - בנות ירושליים
בית ספר - בני אברהם
בית ספר - בני עקיבא אמנה
בית ספר - בני עקיבא כפר הרואה
בית ספר - בני עקיבא נאות אברהם
בית ספר - בני עקיבא רעות
בית ספר - בני צבי
בית ספר - בנים אהבת ישראל
בית ספר - בר אילן
בית ספר - בר אילן
בית ספר - בר אילן
בית ספר - בר אילן
בית ספר - בר אילן בנים
בית ספר - בר לב
בית ספר - בר לב
בית ספר - בראשית
בית ספר - ברוש
בית ספר - ברושים
בית ספר - ברכת אברהם
בית ספר - ברכת בית יוסף
בית ספר - ברכת עופרים
בית ספר - ברל כצנלסון
בית ספר - ברנקו וייס
בית ספר - ברנקו וייס
בית ספר - ברנקו וייס
בית ספר - ברנקו וייס
בית ספר - ברנקו וייס ע"ש שייבר
בית ספר - ברנקו וייס קרית שמונה
בית ספר - ברנר
בית ספר - ברנר
בית ספר - ברנר
בית ספר - ברנרד מילקין
בית ספר - ג
בית ספר - ג
בית ספר - ג'בל זייתון לבנות
בית ספר - ג'בל זייתון לבנים
בית ספר - ג'ואריש
בית ספר - גאולים
בית ספר - גבע
בית ספר - גבעון
בית ספר - גבעת גונן
בית ספר - גבעת הזית
בית ספר - גבעת השלום
בית ספר - גבעת התמרים
בית ספר - גבעת טל
בית ספר - גבריאלי
בית ספר - גבריאלי הכרמל
בית ספר - גוונים
בית ספר - גוונים
בית ספר - גוונים
בית ספר - גוטווירט
בית ספר - גולדה מאיר
בית ספר - גולדה מאיר
בית ספר - גולדה מאיר
בית ספר - גולן
בית ספר - גורדון
בית ספר - גורדון
בית ספר - גורדון
בית ספר - גורדון
בית ספר - גורדון
בית ספר - גיבורי ישראל
בית ספר - גיל
בית ספר - גיל רבין
בית ספר - גילה
בית ספר - גילה א
בית ספר - גימנסיה הרצליה
בית ספר - גימנסיה ליטנטל
בית ספר - גינסבורג
בית ספר - גלבוע
בית ספר - גלילות
בית ספר - גמנסיה סוקולוב לאור
בית ספר - גני מנחם
בית ספר - גנים
בית ספר - גפנים
בית ספר - גרינברג
בית ספר - גרץ
בית ספר - ד
בית ספר - דביר
בית ספר - דגניה
בית ספר - דגניה
בית ספר - דגניה
בית ספר - דה שליט
בית ספר - דוד אליעזר
בית ספר - דוד אלעזר
בית ספר - דוד ילין
בית ספר - דוד רמז
בית ספר - דוד רמז
בית ספר - דורות
בית ספר - דחסידי באואן
בית ספר - דחסידי צאנז דרכי אבות
בית ספר - דמוקרטי הוד השרון
בית ספר - דנציגר
בית ספר - דנציגר
בית ספר - דעת מבונים בי"ס דתי ערכי תורני למדעים
בית ספר - דקל
בית ספר - דקל
בית ספר - דקל וילנאי
בית ספר - דקל וילנאי
בית ספר - דקלים
בית ספר - דרור
בית ספר - דרור
בית ספר - דרך המלך
בית ספר - דרך ישרים
בית ספר - דרך תבונה
בית ספר - דרכי אבות
בית ספר - דרכי אבות
בית ספר - דרכי איש
בית ספר - דרכי חיים
בית ספר - דרכי חינוך
בית ספר - דרכי יהודה
בית ספר - דרכי נועם
בית ספר - דרכי נועם
בית ספר - דרכי נועם
בית ספר - דרכי נעם
בית ספר - דתי מקצועי
בית ספר - דתי נועם בנים
בית ספר - ה
בית ספר - ה
בית ספר - האורטודוקסי
בית ספר - האלה
בית ספר - האמנים
בית ספר - האנגלי
בית ספר - הבונים
בית ספר - הבונים
בית ספר - הבילויים
בית ספר - הבילויים
בית ספר - הבעש"ט
בית ספר - הגבעה למדעים ואמנויות
בית ספר - הגורן
בית ספר - הגימנסיה הראלית
בית ספר - הגמנסיה העברית
בית ספר - הגפן
בית ספר - הדמוקרטי
בית ספר - הדסים
בית ספר - הדסים
בית ספר - הדסים
בית ספר - הדר
בית ספר - הדר
בית ספר - הדר
בית ספר - הדר
בית ספר - הדר יוסף
בית ספר - הדרי
בית ספר - הדרים
בית ספר - הדרים
בית ספר - הוברמן
בית ספר - החורש
בית ספר - החורש
בית ספר - החזיון
בית ספר - החיטה ע"ש אהרונסון
בית ספר - החייל
בית ספר - החסידי לבנות בית יעקב
בית ספר - החשמונאים
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היובל
בית ספר - היסודי ארן
בית ספר - היסודי דוד בלוך
בית ספר - היסודי האזורי גוש עציון
בית ספר - היסודי ירושלמי
בית ספר - הירוק
בית ספר - הלל
בית ספר - הלל צור
בית ספר - המאוחד דתי אמי"ת
בית ספר - המגינים
בית ספר - המכללה למנהל גבעתיים
בית ספר - הממ"ד אזורי בית אל
בית ספר - המנחיל
בית ספר - המסורה
בית ספר - המסורתי עירוני י"ח
בית ספר - המקיף העירוני
בית ספר - המשותף כפר שמריהו וחוף השרון
בית ספר - המתמיד
בית ספר - הנגיד
בית ספר - הנדיב
בית ספר - הנדיב
בית ספר - הנרייטה סאלד
בית ספר - הנשיא
בית ספר - הפתוח הדמוקרטי
בית ספר - הצבי
בית ספר - הצרפתי פרר סן ג'וזף
בית ספר - הקריה מנוחה ונחלה
בית ספר - הר אדר
בית ספר - הר אדר
בית ספר - הרא"ה מדעי לבנות
בית ספר - הראל
בית ספר - הראל
בית ספר - הראל
בית ספר - הראלי
בית ספר - הראם
בית ספר - הראשונים
בית ספר - הראשונים
בית ספר - הראשונים
בית ספר - הרב בהר"ן
בית ספר - הרב מימון
בית ספר - הרב תחומי אבו רביעה
בית ספר - הרוממך
בית ספר - הרי"ן
בית ספר - הריאלי
בית ספר - הריאלי
בית ספר - הריאלי
בית ספר - הריאלי בית בירם
בית ספר - הרצוג
בית ספר - הרצל
בית ספר - הרצל
בית ספר - הרצל
בית ספר - הרצל
בית ספר - הרשב"י
בית ספר - השבעה
בית ספר - השומרון
בית ספר - השחר
בית ספר - השרון
בית ספר - השרון
בית ספר - התומר
בית ספר - התורה
בית ספר - התורה ובית יעקב ע"ש וולפסון
בית ספר - התיכון שש שנתי ע"ש איינשטיין
בית ספר - ואדי אלנסור
בית ספר - וייצמן
בית ספר - ויצ"ו קנדה
בית ספר - ויצמן
בית ספר - ויצמן
בית ספר - ויצמן
בית ספר - ויצמן
בית ספר - ומכללת הנדסאים שפירא
בית ספר - ורדים ביפו
בית ספר - ז
בית ספר - ז'בוטינסקי
בית ספר - זבוטינסקי
בית ספר - זבולון
בית ספר - זבולון
בית ספר - זבולון המר
בית ספר - זבולון המר
בית ספר - זומר
בית ספר - זלמן
בית ספר - זלמן ארן
בית ספר - זלמן ארן
בית ספר - זלמן שזר
בית ספר - ח"ת עץ חיים
בית ספר - חאלדבן אלוליד
בית ספר - חב"ד
בית ספר - חב"ד אור אבנר
בית ספר - חב"ד אור חיה
בית ספר - חב"ד אור מנחם
בית ספר - חב"ד בית חנה
בית ספר - חב"ד בית מנחם
בית ספר - חב"ד בנות אופקים
בית ספר - חב"ד בנים
בית ספר - חב"ד נערי ישראל
בית ספר - חדן
בית ספר - חדר תשב"ר
בית ספר - חדש ע'ש רבין
בית ספר - חוגים
בית ספר - חוה חקלאית
בית ספר - חווה חקלאית בית שאן
בית ספר - חוט השני
בית ספר - חוני המעגל
בית ספר - חופית
בית ספר - חופית
בית ספר - חורב ירושלים
בית ספר - חזון מאיר
בית ספר - חט"ב מיתרים
בית ספר - חטיבה צעירה
בית ספר - חטיבה צעירה מתן
בית ספר - חידר חסידי
בית ספר - חיים חפר
בית ספר - חינוך לבנות בית יעקב החסידי
בית ספר - חינוך מבוגרים
בית ספר - חינוך מיוחד ממ"ד עציון
בית ספר - חינוך עצמאי חשמונאים
בית ספר - חינוכית לחברה ויצירה עמלנית
בית ספר - חנה סנש
בית ספר - חניכי הישיבות
בית ספר - חניכים אורט
בית ספר - חסידי בית יעקב גור
בית ספר - חסידי בית יעקב ורשביאק
בית ספר - חסידי גור
בית ספר - חסידי גור קרית גת
בית ספר - חסן ערפה
בית ספר - חפץ חיים
בית ספר - חצ"ב
בית ספר - חקלאי
בית ספר - חקלאי ויצ"ו
בית ספר - חקלאי ע"ש יוהנה ז'בוטינסקי
בית ספר - חקלאי ע"ש רוטשילד
בית ספר - חקלאי פרדס חנה
בית ספר - חרדי בית יעקב גור אהל צביה
בית ספר - חרדי התורה ובית יעקב
בית ספר - חרדי לבנות
בית ספר - חרדי לבנות - בית יעקב
בית ספר - חרדי לבנות בית יעקב
בית ספר - חרדי לבנות חסידי גור קרית גת
בית ספר - חרדי מכללה טכנולוגית יד חרוצים
בית ספר - חרדי רשב"י
בית ספר - חרדי תש"בר
בית ספר - חשב"ד הגבעה הדרומית
בית ספר - חשמונאים
בית ספר - טוביה
בית ספר - טובייה
בית ספר - טיכנולוגי לנוער מרכז לרכז להכשרה מקצועית
בית ספר - טירה
בית ספר - טירה מרכז
בית ספר - טכנולוגי
בית ספר - טכנולוגי אורט
בית ספר - טכנולוגי אורט לקציני ים
בית ספר - טכנולוגי אורט ע"ש אדיבי
בית ספר - טכנולוגי אמנותי נעמ"ת
בית ספר - טכנולוגי בסמ"ת
בית ספר - טכנולוגי דתי מרכז הנוער
בית ספר - טכנולוגי דתי עמי"ת
בית ספר - טכנולוגי הדסה ויצ"ו
בית ספר - טכנולוגי השרון
בית ספר - טכנולוגי לנוער
בית ספר - טכנולוגי מזור
בית ספר - טכנולוגי נעמ"ת
בית ספר - טכנולוגי נעמ"ת
בית ספר - טכנולוגי נעמ"ת
בית ספר - טכנולוגי ע"ש משה קול
בית ספר - טכנולוגי עמל
בית ספר - טכנולוגי עמל
בית ספר - טכנולוגי עתיד
בית ספר - טל
בית ספר - טרה סנטה
בית ספר - טרומפלדור
בית ספר - טשרניחובסקי
בית ספר - טשרניחובסקי
בית ספר - יבנה
בית ספר - יבנה
בית ספר - יבנה
בית ספר - יבנה
בית ספר - יבנה
בית ספר - יבניאלי
בית ספר - יגאל אלון
בית ספר - יגאל אלון
בית ספר - יגאל אלון
בית ספר - יגאל אלון
בית ספר - יגאל אלון
בית ספר - יגאל אלון ניצנים
בית ספר - יד גיורא
בית ספר - יד המלך
בית ספר - יד יצחק
בית ספר - יד לבנים
בית ספר - יד לבנים
בית ספר - יד מורדכי
בית ספר - יד שבתאי
בית ספר - ידלין
בית ספר - יהודה
בית ספר - יהודה הלוי
בית ספר - יהושע
בית ספר - יהל"ם
בית ספר - יהלום
בית ספר - יהלום
בית ספר - יהלום
בית ספר - יובל
בית ספר - יובלים
בית ספר - יובלים
בית ספר - יובלים
בית ספר - יונתן
בית ספר - יוסף ויתקין
בית ספר - יוסף חיים
בית ספר - יוסף יצחק
בית ספר - יוספטל
בית ספר - יוספטל
בית ספר - יזרעאל
בית ספר - יח"ד
בית ספר - יחדיו
בית ספר - יחידני
בית ספר - יחל ישראל
בית ספר - ימין הרצוג
בית ספר - ימית
בית ספר - יסוד המעלה
בית ספר - יסודות
בית ספר - יסודות מ"מ קהילתי
בית ספר - יסודי
בית ספר - יסודי א חדש
בית ספר - יסודי אורים
בית ספר - יסודי אזהראא
בית ספר - יסודי אל סלאם
בית ספר - יסודי אל שמס
בית ספר - יסודי אלאחיה
בית ספר - יסודי אלביאדר
בית ספר - יסודי אלזהראא
בית ספר - יסודי אלעטאונה
בית ספר - יסודי בית זרזיר
בית ספר - יסודי בן גוריון
בית ספר - יסודי בר לב
בית ספר - יסודי ברנר
בית ספר - יסודי גולדה מאיר
בית ספר - יסודי גיל
בית ספר - יסודי דמוקרטי חזן
בית ספר - יסודי דתי נועם
בית ספר - יסודי הגליל
בית ספר - יסודי הדר השרון
בית ספר - יסודי המגן
בית ספר - יסודי המד
בית ספר - יסודי התורה
בית ספר - יסודי יגאל אלון
בית ספר - יסודי לבנות בית חנינה
בית ספר - יסודי לבנות בית חנינה
בית ספר - יסודי לבנות בית יעקב
בית ספר - יסודי ממלכתי דתי יעד
בית ספר - יסודי ממלכתי דתי סעדיה גאון
בית ספר - יסודי ממלכתי דתי ציפורי
בית ספר - יסודי ממלכתי דתי תחכמוני
בית ספר - יסודי ממלכתי דתיהראל
בית ספר - יסודי ממלכתי יגאל אלון
בית ספר - יסודי ממלכתי נווה נאמן
בית ספר - יסודי ממלכתי שקד
בית ספר - יסודי ממלכתי שרת
בית ספר - יסודי ניסן אמי"ת
בית ספר - יסודי נעמי שמר
בית ספר - יסודי נר גלבוע
בית ספר - יסודי נתיב אור
בית ספר - יסודי ע"ש יצחק רבין
בית ספר - יסודי ערבי לב יפו
בית ספר - יסודי צורים
בית ספר - יסודי רזיאל
בית ספר - יסודי רעות
בית ספר - יסודי שדות
בית ספר - יסודי שחר
בית ספר - יסודי שיזף
בית ספר - יסודי תושיה
בית ספר - יסודי תל"ן
בית ספר - יסודי תפוז
בית ספר - יעבץ
בית ספר - יעלים
בית ספר - יעלים
בית ספר - יעקב כהן
בית ספר - יערת העמק
בית ספר - יפה נוף
בית ספר - יצחק בן צבי
בית ספר - יצחק הנשיא
בית ספר - יצחק טוניק פסגת זאב מזרח ב' תל"י
בית ספר - יצחק נבון
בית ספר - יצחק רבין
בית ספר - יצחק רבין
בית ספר - יצחק רבין
בית ספר - יצחק רבין
בית ספר - יצחק רבין
בית ספר - יצחק רבין
בית ספר - יצחק שדה
בית ספר - יצחק שדה
בית ספר - יקירי רכסים
בית ספר - ירושלים
בית ספר - ישגב
בית ספר - ישורון
בית ספר - ישורון
בית ספר - ישורון
בית ספר - ישיבה תיכונית עירונית
בית ספר - ישיבתית ימין הרצוג
בית ספר - יתד חניכי ישיבות
בית ספר - כוחלה
בית ספר - כולל חסידי פרי התורה
בית ספר - כי"ח
בית ספר - כינור דויד
בית ספר - כלל חסידי דעת מישרים
בית ספר - כלל חסידי לבנות תורת אמך
בית ספר - כלל חסידים
בית ספר - כפיר
בית ספר - כפר אדומים
בית ספר - כפר אמי"ת
בית ספר - כפר גנים
בית ספר - כפר חב"ד
בית ספר - כצנלסון
בית ספר - כצנלסון
בית ספר - כצנלסון
בית ספר - כרמים
בית ספר - כרמים
בית ספר - כרמל
בית ספר - כרמל ים
בית ספר - כרמל נתיב אליעזר
בית ספר - כתב סופר
בית ספר - כתב סופר ערלוי
בית ספר - כתב סופר ערלוי
בית ספר - לאומנויות יצחק בן צבי
בית ספר - לאומנות ומדעים מקסים לוי
בית ספר - לב העמק
בית ספר - לב הפרדס
בית ספר - לב רן
בית ספר - לבאות
בית ספר - לבנות
בית ספר - לבנות
בית ספר - לבנות אוהל שלמה
בית ספר - לבנות אוצר החיים
בית ספר - לבנות אורות עציון
בית ספר - לבנות אל מאמוניה
בית ספר - לבנות אלוני ממרא
בית ספר - לבנות בית חנה חב"ד
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב
בית ספר - לבנות בית יעקב אלשיך
בית ספר - לבנות בית יעקב ש"ס
בית ספר - לבנות בית יעקב תפארת בנות
בית ספר - לבנות בית יעקב תקוות מרגלית
בית ספר - לבנות בית יעקוב
בית ספר - לבנות בית מלכה
בית ספר - לבנות בית רבקה
בית ספר - לבנות בנות חייל
בית ספר - לבנות דרכי תורה
בית ספר - לבנות זכרון אורית
בית ספר - לבנות חב"ד ב' ע"ש אהלי יוסף יצחק
בית ספר - לבנות חב"ד בית ישראל
בית ספר - לבנות חב"ד תפארת חיה מושקא
בית ספר - לבנות ע"ש זבולון המר
בית ספר - לבנות פלך
בית ספר - לבנות קרית ארבע
בית ספר - לבנות שערי יהדות
בית ספר - לבנות תפארת חיה
בית ספר - לבנים
בית ספר - לבנים אורות עציון
בית ספר - לבנים הצבי
בית ספר - לבנים חב"ד
בית ספר - לבנים חרדי שערי ציון
בית ספר - לבנים מעיין חיים ושלום
בית ספר - לבנים מעלות נכוה
בית ספר - להבה
בית ספר - להכשרה מקצועית מירון
בית ספר - לוחמי הגיטאות
בית ספר - לוי אשכול
בית ספר - לוי יצחק
בית ספר - לוין
בית ספר - לוינסון
בית ספר - לוסטיק
בית ספר - לוריא
בית ספר - לחינוך מיוחד
בית ספר - לחם ביכורים
בית ספר - ליאו בק
בית ספר - ליאו בק
בית ספר - ליאו בק
בית ספר - למדע
בית ספר - למדעים בן גוריון
בית ספר - למדעים ואומנויות
בית ספר - למדעים ויהדות
בית ספר - למדעים לוד
בית ספר - למרחב
בית ספר - לפידים
בית ספר - לקציני ים
בית ספר - מ"מ א.ד.גורדון
בית ספר - מ"מ אביגדור
בית ספר - מ"מ אבן סינא
בית ספר - מ"מ אבן עאמר
בית ספר - מ"מ אבראהים טוקאן
בית ספר - מ"מ אומנויות
בית ספר - מ"מ אופיר
בית ספר - מ"מ אופק
בית ספר - מ"מ אופקים
בית ספר - מ"מ אור מאיר
בית ספר - מ"מ אורט ישראל נצרת
בית ספר - מ"מ אורט ע"ש מיטרני
בית ספר - מ"מ איילים
בית ספר - מ"מ אילנות
בית ספר - מ"מ אילנות
בית ספר - מ"מ אל אמל
בית ספר - מ"מ אל ג'ליל
בית ספר - מ"מ אל קסטל
בית ספר - מ"מ אלאוסופיה
בית ספר - מ"מ אלאמרייה
בית ספר - מ"מ אלון
בית ספר - מ"מ אלון
בית ספר - מ"מ אלון
בית ספר - מ"מ אלונים
בית ספר - מ"מ אלחורש א
בית ספר - מ"מ אלכרום
בית ספר - מ"מ אלמג'ד
בית ספר - מ"מ אלמוג
בית ספר - מ"מ אלראזי
בית ספר - מ"מ אמירים
בית ספר - מ"מ אמירים
בית ספר - מ"מ ארזים
בית ספר - מ"מ ארליך
בית ספר - מ"מ אשכול
בית ספר - מ"מ אשכולות
בית ספר - מ"מ אשלים אומנויות
בית ספר - מ"מ אתרים
בית ספר - מ"מ ב' רמת רזים
בית ספר - מ"מ בארי
בית ספר - מ"מ ביאליק
בית ספר - מ"מ ביר אלאמיר
בית ספר - מ"מ בית יחזקאל ע"ש דר יחזקאל זונאבנד
בית ספר - מ"מ בן גוריון
בית ספר - מ"מ בן גוריון
בית ספר - מ"מ בן גוריון
בית ספר - מ"מ בן צבי
בית ספר - מ"מ בן צבי
בית ספר - מ"מ בפטיסטי
בית ספר - מ"מ ברטוב
בית ספר - מ"מ ברנדיס
בית ספר - מ"מ ג המאוחד
בית ספר - מ"מ ג'ובראן חליל
בית ספר - מ"מ גאולים
בית ספר - מ"מ גולן
בית ספר - מ"מ גורדון
בית ספר - מ"מ גורדון ליוזמה תיירותית וסביבה
בית ספר - מ"מ גלבוע
בית ספר - מ"מ גלעד לאומנויות
בית ספר - מ"מ גן יער
בית ספר - מ"מ ד' אלשרק
בית ספר - מ"מ דורות
בית ספר - מ"מ דקל
בית ספר - מ"מ האירוסים
בית ספר - מ"מ הבנים
בית ספר - מ"מ הדקל
בית ספר - מ"מ הדר
בית ספר - מ"מ הדר ארזים
בית ספר - מ"מ הדרים
בית ספר - מ"מ היובל
בית ספר - מ"מ המגינים
בית ספר - מ"מ המשיח האוונגלית אפיסקופית
בית ספר - מ"מ הנדיב
בית ספר - מ"מ הפרחים
בית ספר - מ"מ הר נוף
בית ספר - מ"מ הראל
בית ספר - מ"מ הרי אילת
בית ספר - מ"מ הרעות ע"ש יצחק רבין
בית ספר - מ"מ הרצוג
בית ספר - מ"מ הרצל
בית ספר - מ"מ השלום
בית ספר - מ"מ השרון
בית ספר - מ"מ התבור
בית ספר - מ"מ וילקומיץ
בית ספר - מ"מ ויצמן
בית ספר - מ"מ ויצמן
בית ספר - מ"מ ויתקין
בית ספר - מ"מ זאב זבוטינסקי
בית ספר - מ"מ זבוטינסקי
בית ספר - מ"מ זיו
בית ספר - מ"מ זלמן שז"ר
בית ספר - מ"מ ח.ברנר
בית ספר - מ"מ חביב
בית ספר - מ"מ חופית
בית ספר - מ"מ חרמון
בית ספר - מ"מ טומשין
בית ספר - מ"מ טכנולוגי נעמת
בית ספר - מ"מ טרה סנטה נצרת
בית ספר - מ"מ יהושוע גן
בית ספר - מ"מ יודפת לתקשוב
בית ספר - מ"מ יוחנני
בית ספר - מ"מ יעלים
בית ספר - מ"מ יעקב ניב
בית ספר - מ"מ יפה נוף
בית ספר - מ"מ יצחק בן צבי
בית ספר - מ"מ ישוע הנער דון בוסקו
בית ספר - מ"מ ישראל ישעיהו
בית ספר - מ"מ כינר
בית ספר - מ"מ כלנית
בית ספר - מ"מ כסולות לתקשורת
בית ספר - מ"מ כצנלסון
בית ספר - מ"מ כרמל לאומנויות ותרבות הספורט
בית ספר - מ"מ לאומנויות יחדיו
בית ספר - מ"מ לאומניות אפיק
בית ספר - מ"מ לב טוב
בית ספר - מ"מ לוי אשכול
בית ספר - מ"מ מאי זיאדה
בית ספר - מ"מ מגד
בית ספר - מ"מ מצפה ים
בית ספר - מ"מ מרכז נוער
בית ספר - מ"מ משה הס
בית ספר - מ"מ נווה צאלים
בית ספר - מ"מ נווה שלום
בית ספר - מ"מ נועם הרצוג
בית ספר - מ"מ נוף ים
בית ספר - מ"מ נחשוני החולה
בית ספר - מ"מ נטעים
בית ספר - מ"מ ניצנים
בית ספר - מ"מ ניצנים
בית ספר - מ"מ ניר
בית ספר - מ"מ נפתלי
בית ספר - מ"מ סביון גני יהודה
בית ספר - מ"מ ע"ש דינור
בית ספר - מ"מ ע"ש יאנוש קורצ'אק
בית ספר - מ"מ ע"ש יהודה בכר
בית ספר - מ"מ ע"ש תאופיק זיאד
בית ספר - מ"מ עירוני כללי רמז
בית ספר - מ"מ עלומים
בית ספר - מ"מ עלומים
בית ספר - מ"מ עציון גבר ללימודי הסביבה
בית ספר - מ"מ עצמון לחינוך סביבתי
בית ספר - מ"מ עתידים
בית ספר - מ"מ עתידים ע"ש מ.אלישיב
בית ספר - מ"מ פלמ"ח
בית ספר - מ"מ צאלים
בית ספר - מ"מ צופה השרון
בית ספר - מ"מ קהילתי אילנות
בית ספר - מ"מ קהילתי גולדה מאיר
בית ספר - מ"מ קהילתי להבים
בית ספר - מ"מ קהילתי לפיד
בית ספר - מ"מ קהילתי נווה דקלים
בית ספר - מ"מ קהילתי נטופה למדעים
בית ספר - מ"מ קהילתי ע"ש ח.ארלוזורוב
בית ספר - מ"מ קוממיות
בית ספר - מ"מ קשת
בית ספר - מ"מ רביבים למדעי הטבע והסביבה
בית ספר - מ"מ רמז
בית ספר - מ"מ רמת אפעל
בית ספר - מ"מ רמת רבין
בית ספר - מ"מ רעות
בית ספר - מ"מ רעות
בית ספר - מ"מ רעננים
בית ספר - מ"מ רקפת
בית ספר - מ"מ רתמים
בית ספר - מ"מ שז"ר
בית ספר - מ"מ שיקמה
בית ספר - מ"מ שנקר
בית ספר - מ"מ שער האריות
בית ספר - מ"מ שקד
בית ספר - מ"מד סיני
בית ספר - מאה שערים
בית ספר - מאה שערים
בית ספר - מאיר
בית ספר - מאיר עיניים
בית ספר - מאירי
בית ספר - מבועים
בית ספר - מבשרת
בית ספר - מגדל אור
בית ספר - מגינים
בית ספר - מגן
בית ספר - מגן אבות
בית ספר - מגן אבות בנים
בית ספר - מדעי טכנולוגי ממלכתי א
בית ספר - מדעי תורני יגאל אלון
בית ספר - מדעי תורני מימון
בית ספר - מדעים
בית ספר - מדעים ויהדות
בית ספר - מדעית
בית ספר - מדעית
בית ספר - מדרשיית נעם לבנים
בית ספר - מדרשת הגליל
בית ספר - מודיעין
בית ספר - מודיעין עילית
בית ספר - מולדת
בית ספר - מוסדות פאר יוסף
בית ספר - מוסינזון
בית ספר - מוסמוס
בית ספר - מוצקין
בית ספר - מור
בית ספר - מורדי הגטאות
בית ספר - מורדי הגטאות
בית ספר - מוריה
בית ספר - מוריה
בית ספר - מוריה
בית ספר - מוריה
בית ספר - מורשה
בית ספר - מורשה
בית ספר - מורשת
בית ספר - מורשת ירושלים
בית ספר - מורשת נריה
בית ספר - מח"ט 1 רשת עמל
בית ספר - מחשבה
בית ספר - מטה בנימין
בית ספר - מטרו ווסט
בית ספר - מיוחד דקלים
בית ספר - מיוחד לוי אשכול
בית ספר - מיכאל שליט"א
בית ספר - מירון
בית ספר - מישור הנוף
בית ספר - מכבים
בית ספר - מכל"ל
בית ספר - מכתב מאליהו
בית ספר - מכתב מאליהו
בית ספר - מל"ל
בית ספר - מלכתי א.ד.גורדון
בית ספר - ממ"ד
בית ספר - ממ"ד
בית ספר - ממ"ד אבני חושן
בית ספר - ממ"ד אהל שלום
בית ספר - ממ"ד אוהל מאיר
בית ספר - ממ"ד אוהל שרה
בית ספר - ממ"ד אור השרון
בית ספר - ממ"ד אורות
בית ספר - ממ"ד אלונים
בית ספר - ממ"ד אמי"ת ע"ש המר
בית ספר - ממ"ד אפרתי
בית ספר - ממ"ד ארבל
בית ספר - ממ"ד אריאל
בית ספר - ממ"ד אריאל
בית ספר - ממ"ד אריאל
בית ספר - ממ"ד אריאל
בית ספר - ממ"ד אשכול
בית ספר - ממ"ד בדרכי נועם
בית ספר - ממ"ד ביל"ו
בית ספר - ממ"ד בית יוסף
בית ספר - ממ"ד בניהו
בית ספר - ממ"ד בר אילן
בית ספר - ממ"ד בר אילן
בית ספר - ממ"ד ברנע
בית ספר - ממ"ד האר"י
בית ספר - ממ"ד הבעל שמטוב
בית ספר - ממ"ד הדסים
בית ספר - ממ"ד הקריה
בית ספר - ממ"ד הרא"ה
בית ספר - ממ"ד הרא"ה
בית ספר - ממ"ד הרוא"ה
בית ספר - ממ"ד הרמב"ם
בית ספר - ממ"ד זבולון המר
בית ספר - ממ"ד חב"ד
בית ספר - ממ"ד חב"ד
בית ספר - ממ"ד חב"ד
בית ספר - ממ"ד חב"ד
בית ספר - ממ"ד חב"ד
בית ספר - ממ"ד חברון
בית ספר - ממ"ד חורב
בית ספר - ממ"ד חזון יעקב
בית ספר - ממ"ד טכנולוגי אמי"ת
בית ספר - ממ"ד יד אליהו
בית ספר - ממ"ד יהל"ם
בית ספר - ממ"ד ישורון
בית ספר - ממ"ד ישורון
בית ספר - ממ"ד לבנות מוהליבר
בית ספר - ממ"ד מדעי קהילתי רמב"ם
בית ספר - ממ"ד מוריה
בית ספר - ממ"ד מוריה
בית ספר - ממ"ד מורשה
בית ספר - ממ"ד מורשת
בית ספר - ממ"ד מורשת זבולון
בית ספר - ממ"ד מורשת משה
בית ספר - ממ"ד מיימון
בית ספר - ממ"ד מירון
בית ספר - ממ"ד מקור חיים
בית ספר - ממ"ד נועם
בית ספר - ממ"ד נועם הרצוג
בית ספר - ממ"ד נועם נריה
בית ספר - ממ"ד סיני
בית ספר - ממ"ד עוזיאל
בית ספר - ממ"ד עירוני יבנה
בית ספר - ממ"ד עמיאל
בית ספר - ממ"ד פסגה
בית ספר - ממ"ד פסגה
בית ספר - ממ"ד ק.הרצוג
בית ספר - ממ"ד רמב"ם
בית ספר - ממ"ד רמב"ם
בית ספר - ממ"ד רמב"ם
בית ספר - ממ"ד שחר
בית ספר - ממ"ד שילה
בית ספר - ממ"ד שילה
בית ספר - ממ"ד תדהר
בית ספר - ממ"ד תורני אזורי הראל
בית ספר - ממ"ד תורני ברויאר חפץ חיים
בית ספר - ממ"ד תורני מדעי יבנה
בית ספר - ממ"ד תורני ניצני קטיף
בית ספר - ממ"ד תחכומני
בית ספר - ממ"ד תלפיות מזרח
בית ספר - ממ"ד תפארתנו
בית ספר - ממד אורות בנות
בית ספר - ממד חבד
בית ספר - ממלכתי א
בית ספר - ממלכתי א
בית ספר - ממלכתי אביגל
בית ספר - ממלכתי אבן חלדון
בית ספר - ממלכתי און
בית ספר - ממלכתי אור האמת
בית ספר - ממלכתי אור קדרון
בית ספר - ממלכתי אורנית
בית ספר - ממלכתי אזורי גבעת זאב
בית ספר - ממלכתי איזורי בכר רוסו
בית ספר - ממלכתי אל חכאמה
בית ספר - ממלכתי אל מותנבי
בית ספר - ממלכתי אלחינסא
בית ספר - ממלכתי אלי כהן
בית ספר - ממלכתי אמירים
בית ספר - ממלכתי אמירים א ג
בית ספר - ממלכתי אשכול
בית ספר - ממלכתי ב
בית ספר - ממלכתי ב' פסגת דוד
בית ספר - ממלכתי בית יעקב לבנים
בית ספר - ממלכתי ברקאי
בית ספר - ממלכתי ג
בית ספר - ממלכתי גמלא
בית ספר - ממלכתי דוד בן גוריון
בית ספר - ממלכתי דוד סטון
בית ספר - ממלכתי דעת זקנים
בית ספר - ממלכתי דתי אור חנה
בית ספר - ממלכתי דתי בית יעקב
בית ספר - ממלכתי דתי התורה
בית ספר - ממלכתי דתי חב"ד
בית ספר - ממלכתי דתי יובלים
בית ספר - ממלכתי דתי מודעין
בית ספר - ממלכתי דתי ממ"ד
בית ספר - ממלכתי דתי נצח ישראל
בית ספר - ממלכתי דתי צמח השדה
בית ספר - ממלכתי דתי ראבן רבי יצחקי
בית ספר - ממלכתי דתי רשב"י
בית ספר - ממלכתי הגבעה הצהובה
בית ספר - ממלכתי הדרים
בית ספר - ממלכתי היובל
בית ספר - ממלכתי חזון עובדיה
בית ספר - ממלכתי יאנוש קורצ'אק
בית ספר - ממלכתי יגאל אלון
בית ספר - ממלכתי יורה דעה
בית ספר - ממלכתי יסודי קשת
בית ספר - ממלכתי לוי אשכול
בית ספר - ממלכתי לפיד
בית ספר - ממלכתי מגדים
בית ספר - ממלכתי מעלה
בית ספר - ממלכתי מפלסים
בית ספר - ממלכתי משואה
בית ספר - ממלכתי נופי סלע
בית ספר - ממלכתי נחשונים
בית ספר - ממלכתי נעם
בית ספר - ממלכתי נעמי שמר
בית ספר - ממלכתי ע"ש ויטבנקין
בית ספר - ממלכתי ע"ש זבקד גרובר
בית ספר - ממלכתי על שם הולנדר
בית ספר - ממלכתי פינס
בית ספר - ממלכתי צליל
בית ספר - ממלכתי קהילתי גדרות ע"ש ישראל גורליק
בית ספר - ממלכתי קהילתי פרדס צפוני ע"ש בפ"ר
בית ספר - ממלכתי קריית ארבע
בית ספר - ממלכתי ראשונים
בית ספר - ממלכתי רמות ויצמן
בית ספר - ממלכתי רמת אלון
בית ספר - ממלכתי שילה
בית ספר - ממלכתי שילה
בית ספר - ממלכתי שקד
בית ספר - ממלכתי תומר רחל ל
בית ספר - ממלכתי תורת חיים
בית ספר - ממלכתי תל חי
בית ספר - ממלכתי תל"י בית וגן
בית ספר - מנחם
בית ספר - מנחם בגין
בית ספר - מנחם בגין
בית ספר - מנחם בגין
בית ספר - מנחם בגין
בית ספר - מנחם בגין
בית ספר - מנחת יצחק
בית ספר - מסילות
בית ספר - מסילות
בית ספר - מע"ש בית נוה רון
בית ספר - מעוז המכבים
בית ספר - מעונות ד
בית ספר - מעיין
בית ספר - מעיין חיים ושלום ש"ס לבנים
בית ספר - מעיינות
בית ספר - מעיינות חיה
בית ספר - מעיינות מפתן
בית ספר - מעלה הזיתים
בית ספר - מעלה הכרמל
בית ספר - מעלה התורה ממ"ד
בית ספר - מעלה סביונים
בית ספר - מעלות
בית ספר - מעלות
בית ספר - מעלות דפנה
בית ספר - מעלות חיים
בית ספר - מעלות משלום
בית ספר - מעלות ניסים
בית ספר - מעלות רחל בית יעקב
בית ספר - מענה שמחה
בית ספר - מענית
בית ספר - מפי עוללים
בית ספר - מפת"ן אלמוג
בית ספר - מפתן אלונים
בית ספר - מפתן ברק
בית ספר - מפתן חרמון
בית ספר - מפתן נחשונים מגמה חינוכית לחברה ויצירה
בית ספר - מפתן נעורים
בית ספר - מצדה מדערום
בית ספר - מצודות
בית ספר - מצפה
בית ספר - מצפה
בית ספר - מצפה יריחו
בית ספר - מצפור
בית ספר - מקי"ם
בית ספר - מקיף
בית ספר - מקיף
בית ספר - מקיף א סאלח ח'ניפס
בית ספר - מקיף אורט
בית ספר - מקיף אורט אל הוושלה
בית ספר - מקיף אורט כרמים
בית ספר - מקיף אורט ע"ש הורוביץ
בית ספר - מקיף אורט ערד ע"ש צימטבאום
בית ספר - מקיף אל פארוק
בית ספר - מקיף אלנג'אח
בית ספר - מקיף אלראזי
בית ספר - מקיף אריאל
בית ספר - מקיף בית חנה
בית ספר - מקיף ג' עמית עמל
בית ספר - מקיף גרוס
בית ספר - מקיף ד' גן נחום
בית ספר - מקיף דאר אלקלם
בית ספר - מקיף דתי י
בית ספר - מקיף ו' ע"ש יגאל אלון
בית ספר - מקיף ומכללה אורט הבונים
בית ספר - מקיף ז' עמל
בית ספר - מקיף ז' רביבים
בית ספר - מקיף ח
בית ספר - מקיף חדרה חט"ב ב
בית ספר - מקיף חי
בית ספר - מקיף ט' נאות אשלים
בית ספר - מקיף י' אבני החושן
בית ספר - מקיף י"ב
בית ספר - מקיף יהוד
בית ספר - מקיף לבנים אבן רושד
בית ספר - מקיף מ"מ אורט למדע וטכנולוגיה
בית ספר - מקיף מ"מ אורט משה שרת
בית ספר - מקיף מ"מ אורט ע"ש יגאל אלון
בית ספר - מקיף מ"מ אפרים קציר
בית ספר - מקיף מ"מ דמוקרטי מסאר
בית ספר - מקיף מ"מ ע"ש יצחק נבון
בית ספר - מקיף מ"מ שש שנתי הרצוג למדעים ואומנויות
בית ספר - מקיף מ"מ שש שנתי ק.שרת
בית ספר - מקיף ממ"ד כרם שלמה
בית ספר - מקיף ע"ש יצחק רבין
בית ספר - מקיף ע"ש קוהל
בית ספר - מקיף ע"ש רגר
בית ספר - מקיף עומר
בית ספר - מקיף עירוני א
בית ספר - מקיף עירוני ג
בית ספר - מקיף עירוני ד ע"ש רבין
בית ספר - מקיף עירוני ע"ש פנחס אילון
בית ספר - מקיף עירוני עמל
בית ספר - מקיף עמל
בית ספר - מקיף עמל
בית ספר - מקיף עמל א
בית ספר - מקיף עמל ליידי דייויס
בית ספר - מקיף ערבי רמלה לוד
בית ספר - מקיף עתיד אלנור
בית ספר - מקיף פרקאוף
בית ספר - מקיף צומח
בית ספר - מקיף צפוני ע"ש יצחק רבין
בית ספר - מקיף רבין
בית ספר - מקיף רבין
בית ספר - מקיף רוגוזין
בית ספר - מקיף רוטברג
בית ספר - מקיף רמת גן
בית ספר - מקיף שגב שלום
בית ספר - מקיף שלאון
בית ספר - מקיף שש שנתי ע"ש ד"ר חיים קוגל
בית ספר - מקצועי אור ציון
בית ספר - מקצועי אורט רמות
בית ספר - מקצועי ומכללה טכנולוגית אורט
בית ספר - מקצועי מפתן
בית ספר - מקצועי עמל
בית ספר - מקצועי רוז מצקין
בית ספר - מקצועי שע"י המכללה למנהל
בית ספר - מקצועי תורה ומלאכה
בית ספר - מר אליאס
בית ספר - מרגילות
בית ספר - מרדכי טביב
בית ספר - מרחביה
בית ספר - מרחבים
בית ספר - מרחבים
בית ספר - מרכז
בית ספר - מרכז ב"ב
בית ספר - מרכז חינוך אורט
בית ספר - מרכז חינוך לבנות בית ברכה
בית ספר - מרכז טכנולוגי אמי"ת
בית ספר - מרכז טכנולוגי חינוכי
בית ספר - מרכז טכנולוגי עתיד
בית ספר - מרכז טכני ע"ש מ.נמיר
בית ספר - מרכז רוחני לתורה ואהבת ישראל
בית ספר - משגב
בית ספר - משה הס
בית ספר - משה שרת
בית ספר - משה שרת
בית ספר - משה שרת
בית ספר - משה שרת
בית ספר - משה שרת
בית ספר - משואה
בית ספר - משואת נריה
בית ספר - משכן מאיר
בית ספר - משכנות תמר
בית ספר - משנת יהודה
בית ספר - משען עלומים
בית ספר - נאות דוד
בית ספר - נאות לון
בית ספר - נאות מרגלית
בית ספר - נאות מרגלית
בית ספר - נאות מרגלית
בית ספר - נביאים
בית ספר - נגבה
בית ספר - נוה במדבר
בית ספר - נוה חמד
בית ספר - נוה עוז
בית ספר - נוה עוז
בית ספר - נוה שרה
בית ספר - נווה אחיעזר לבנות
בית ספר - נווה אחיעזר לבנים
בית ספר - נווה אריאל
בית ספר - נווה ארץ
בית ספר - נווה דליה
בית ספר - נווה דקלים
בית ספר - נווה דקלים
בית ספר - נווה חוף
בית ספר - נווה יוכבד בית יעקב
בית ספר - נווה יונתן
בית ספר - נווה יעקוב
בית ספר - נווה מרגלית
בית ספר - נווה עציון
בית ספר - נווה צבי
בית ספר - נווה רוחמה
בית ספר - נווה שאנן
בית ספר - נווה שלום
בית ספר - נועם
בית ספר - נועם
בית ספר - נועם
בית ספר - נועם אורות
בית ספר - נועם אליהו
בית ספר - נועם צבי
בית ספר - נוף ילדות
בית ספר - נוף ים
בית ספר - נוף צורים
בית ספר - נופי גולן
בית ספר - נופים
בית ספר - נופים
בית ספר - נופים
בית ספר - נופים
בית ספר - נופית
בית ספר - נופרים
בית ספר - נורדאו
בית ספר - נזירות סנט ג'וזף
בית ספר - נחום סוקולוב
בית ספר - נחמיה תמרי
בית ספר - נחשון
בית ספר - נחשונים
בית ספר - נטעי מאיר
בית ספר - נטעים
בית ספר - ניל"י
בית ספר - ניסויי איזורי ממלכתי אביחיל
בית ספר - ניצני השרון
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניצנים
בית ספר - ניר
בית ספר - נירים
בית ספר - נס דוד
בית ספר - נעורים
בית ספר - נעמ"ת
בית ספר - נעמי שמר
בית ספר - נפש החיים
בית ספר - נצח ישראל לבנות
בית ספר - נר עציון
בית ספר - נראה אור
בית ספר - נראה אור
בית ספר - נרקיסים
בית ספר - נתיב
בית ספר - נתיב
בית ספר - נתיב אור
בית ספר - נתיב יצחק
בית ספר - נתיב מאור
בית ספר - נתיבות התורה
בית ספר - נתיבות יורם
בית ספר - נתיבות משה
בית ספר - נתיבות רבקה
בית ספר - נתיבות שלום
בית ספר - נתיבי נועם
בית ספר - נתיבי נועם
בית ספר - נתיבים
בית ספר - נתן יונתן
בית ספר - סאלח אדין
בית ספר - סביון
בית ספר - סביונים
בית ספר - סביונים
בית ספר - סביונים
בית ספר - סגולה
בית ספר - סוייר
בית ספר - סיני
בית ספר - סיני
בית ספר - סיני
בית ספר - סיני
בית ספר - סלומון
בית ספר - סמילנסקי
בית ספר - סמינר בית יעקב תומר דבורה
בית ספר - סמינר לבנות בית יעקב
בית ספר - סנט ג'וזף
בית ספר - סעדיה גאון
בית ספר - ספיר
בית ספר - ע"ש אביגדור ורשה
בית ספר - ע"ש אהוד מנור
בית ספר - ע"ש אוסטרובסקי
בית ספר - ע"ש אילן רמון
בית ספר - ע"ש בגין
בית ספר - ע"ש בגין
בית ספר - ע"ש ד"ר אבי רומי
בית ספר - ע"ש זבולון המר
בית ספר - ע"ש חיים ברנר
בית ספר - ע"ש יאנוש קורצ'ק
בית ספר - ע"ש יאנוש קורצי
בית ספר - ע"ש יגאל אלון
בית ספר - ע"ש יונתן נתניהו
בית ספר - ע"ש יונתן נתניהו
בית ספר - ע"ש יצחק רבין
בית ספר - ע"ש יצחק רבין
בית ספר - ע"ש מיכה רייסר
בית ספר - ע"ש נעמי שמר
בית ספר - ע"ש עאטף חטיב
בית ספר - ע"ש שמעוני
בית ספר - עבד אל רחמן אל חאג
בית ספר - עוזיאל
בית ספר - עוזיאל
בית ספר - עולי מנחם
בית ספר - עומר אבן אל ח'טאב
בית ספר - עומר אבן אלח'טאב
בית ספר - עומר אבן אלחטאב ובית ספר ברא מקיף
בית ספר - עומר בן אלח'טאב
בית ספר - עומרים
בית ספר - עוספיא
בית ספר - עופרים
בית ספר - עוצר חיים
בית ספר - עטרת חיים
בית ספר - עטרת יצחק
בית ספר - עטרת שלמה
בית ספר - עטרת שלמה
בית ספר - עידוד
בית ספר - עידנים
בית ספר - עידנים
בית ספר - עין גנים
בית ספר - עין הים
בית ספר - עין הקורא
בית ספר - עיסאוויה בנות
בית ספר - עיסאוויה בנים
בית ספר - עירוני א
בית ספר - עירוני ב
בית ספר - עירוני ב
בית ספר - עירוני ד
בית ספר - עירוני ד
בית ספר - עירוני ד
בית ספר - עירוני ה
בית ספר - עירוני ה
בית ספר - עירוני המתמיד
בית ספר - עירוני ו
בית ספר - עירוני ז' ע"ש אילן רמון
בית ספר - עירוני חדש
בית ספר - עירוני ט
בית ספר - עירוני י"א
בית ספר - עירוני י"ב
בית ספר - עירוני י"ד
בית ספר - עירוני מקיף ראשונים
בית ספר - על יסודי חב"ד בנות מנחם
בית ספר - על יסודי מ"מ מקיף ה
בית ספר - על יסודי תורני נאות אסתר
בית ספר - עלומים
בית ספר - עלומים
בית ספר - עלומים
בית ספר - עלומים ע"ש פיינברג
בית ספר - עלי גבעה
בית ספר - עליות
בית ספר - עליזה בגין
בית ספר - עמישב
בית ספר - עמית
בית ספר - עמית
בית ספר - עמית
בית ספר - עמית
בית ספר - עמל
בית ספר - עמל
בית ספר - עמל
בית ספר - עמל 1
בית ספר - עמל 1
בית ספר - עמל א ע"ש ליידי דייוויס
בית ספר - עמל בגליל
בית ספר - עמל טכנולוגי
בית ספר - עמל ליידי דייויס
בית ספר - עמלנית שלום
בית ספר - עמרבן אל רוטאב
בית ספר - ענבלים
בית ספר - עפרה
בית ספר - עץ הדעת
בית ספר - עץ חיים
בית ספר - עציון
בית ספר - עציון
בית ספר - עצמאות
בית ספר - עצמאות גיבורי עציון
בית ספר - עראק אלג'ראב
בית ספר - ערב אל מזריב
בית ספר - ערבי
בית ספר - ערמונים
בית ספר - עשה חיל
בית ספר - עתיד
בית ספר - עתיד
בית ספר - עתיד
בית ספר - עתיד
בית ספר - עתיד אופקים
בית ספר - עתידים
בית ספר - עתידים
בית ספר - עתלית
בית ספר - פ"ת המכללה למנהל
בית ספר - פאר עם
בית ספר - פארוק נסיוני קהילתי
בית ספר - פולג
בית ספר - פיטמן
בית ספר - פיינשטיין
בית ספר - פיכמן
בית ספר - פינסקר
בית ספר - פינסקר
בית ספר - פיס
בית ספר - פיס
בית ספר - פיס
בית ספר - פיס
בית ספר - פיס
בית ספר - פיס
בית ספר - פיס השלום
בית ספר - פיס יצחק רבין
בית ספר - פיס מ"מ כוכב הצפון
בית ספר - פיס נופר
בית ספר - פיס ע"ש לאה גולדברג
בית ספר - פיס רות ג
בית ספר - פיק"א
בית ספר - פלך
בית ספר - פני מאיר
בית ספר - פסגות
בית ספר - פסגות
בית ספר - פסגות
בית ספר - פסגת זאב
בית ספר - פסגת זאב מזרח
בית ספר - פסגת זאב צפון
בית ספר - פרו תואר
בית ספר - פרי מגדים
בית ספר - פרנטיס
בית ספר - פרנקל
בית ספר - פרס נובל
בית ספר - פתוח דמוקרטי
בית ספר - צאלון
בית ספר - צבי שפירא
בית ספר - צביה
בית ספר - צביה
בית ספר - צביה
בית ספר - צביה
בית ספר - צוקים
בית ספר - צור באהר לבנים
בית ספר - צור שלום
בית ספר - צורים
בית ספר - צורים
בית ספר - צמח דוד רבי שמעון בר יוחאי
בית ספר - צמח השדה וחטיבה צעירה
בית ספר - צמח צדיק ויזניץ
בית ספר - צפרירים
בית ספר - צפרירים
בית ספר - קדימה
בית ספר - קדימה צורן
בית ספר - קדמה תיכון עיוני בקהילה
בית ספר - קהילת הליכות עולם- ברכת אברהם
בית ספר - קהילת יעקב
בית ספר - קהילת יעקב
בית ספר - קהילת יעקב החדשה
בית ספר - קהילתי
בית ספר - קהילתי אוש"א
בית ספר - קהילתי אזורי בית יעקב
בית ספר - קהילתי אלגדיר
בית ספר - קהילתי אלמנארה
בית ספר - קהילתי ברכת ישראל
בית ספר - קהילתי גבים
בית ספר - קהילתי הדרים
בית ספר - קהילתי הראל
בית ספר - קהילתי הראל
בית ספר - קהילתי מעפילים
בית ספר - קהילתי סיני
בית ספר - קהילתי על אזורי אולומות
בית ספר - קהילתי צהלה
בית ספר - קהילתי רמת החייל
בית ספר - קהילתי רעים
בית ספר - קודייראת
בית ספר - קול יהודה
בית ספר - קול יעקב
בית ספר - קומותים
בית ספר - קורצ'אק
בית ספר - קורצ'אק
בית ספר - קורצ'ק
בית ספר - קורצק
בית ספר - קורצק
בית ספר - קיבוץ גלויות
בית ספר - קיסריה
בית ספר - קלמן
בית ספר - קלעי
בית ספר - קפלן
בית ספר - קציר
בית ספר - קציר
בית ספר - קציר א
בית ספר - קרול
בית ספר - קרית בנות
בית ספר - קרית גנים
בית ספר - קרית חיים
בית ספר - קרית חינוך אורט ע"ש חלמי שאפי
בית ספר - קרית חינוך אורט קרית ביאליק
בית ספר - קרית חינוך דתי
בית ספר - קרית חינוך חסידי גור
בית ספר - קרית חינוך משכנותיך ישראל
בית ספר - קרית יעקב הרצוג
בית ספר - קרית יערים
בית ספר - קרית ספר
בית ספר - קרית שרת מתחם אלון
בית ספר - קשת
בית ספר - קשת
בית ספר - ראהבת וארדיה
בית ספר - ראשונים
בית ספר - ראשידיה
בית ספר - ראשית
בית ספר - רב כהנמן
בית ספר - רב תחומי
בית ספר - רבי עקיבא
בית ספר - רביבים
בית ספר - רבין
בית ספר - רבין
בית ספר - רבין
בית ספר - רבין
בית ספר - רבן גמליאל
בית ספר - רגבים
בית ספר - רוגוזין
בית ספר - רוגוזין
בית ספר - רוגוזין א
בית ספר - רוגוזין ב
בית ספר - רודמן
בית ספר - רודמן
בית ספר - רודמן
בית ספר - רוזן
בית ספר - רוטשילד
בית ספר - רוממה
בית ספר - רועי קליין
בית ספר - רוקח
בית ספר - רחביה ע"ש ד. ופ. בן גוריון
בית ספר - ריגלר
בית ספר - רימון
בית ספר - רימון
בית ספר - רימון
בית ספר - רימון
בית ספר - רימון
בית ספר - רימונים
בית ספר - רימונים
בית ספר - רימונים
בית ספר - רימל"ט
בית ספר - רמב"ם
בית ספר - רמב"מ
בית ספר - רמב"ם
בית ספר - רמב"ם
בית ספר - רמב"ם
בית ספר - רמב"ם
בית ספר - רמב"ם
בית ספר - רמון
בית ספר - רמות
בית ספר - רמות
בית ספר - רמות
בית ספר - רמות
בית ספר - רמות
בית ספר - רמות יצחק א
בית ספר - רמז
בית ספר - רמז
בית ספר - רמת אביב ג ע"ש אפשטיין
בית ספר - רמת אביב החדשה
בית ספר - רמת אלון
בית ספר - רמת גונן
בית ספר - רמת גן
בית ספר - רמת קרניאל
בית ספר - רמת שרת
בית ספר - רנה קאסן-מעלה דפנה
בית ספר - רננות מזור
בית ספר - רננים
בית ספר - רננים
בית ספר - רעות
בית ספר - רעות
בית ספר - רעות
בית ספר - רעות
בית ספר - רעות
בית ספר - רעות
בית ספר - רעות בוסתן
בית ספר - רעיה
בית ספר - רעים
בית ספר - רעים
בית ספר - רש"י
בית ספר - רש"י
בית ספר - רשיש
בית ספר - רשמי ד
בית ספר - רשת חינוכית תורנית- אולפנת צביה
בית ספר - ש"י עגנון
בית ספר - ש"ס מעין התורה
בית ספר - שארית ישראל
בית ספר - שבח מופת
בית ספר - שבטי ישראל
בית ספר - שדה גליל תחתון
בית ספר - שדות
בית ספר - שדי חמד
בית ספר - שובו
בית ספר - שובו
בית ספר - שובו
בית ספר - שובו אומנות גרי
בית ספר - שובו בנות
בית ספר - שובו טירת שלום
בית ספר - שובו רננים
בית ספר - שובו שע"י החינוך העצמי אהל נאה
בית ספר - שועפת
בית ספר - שורשים
בית ספר - שורשים
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שז"ר
בית ספר - שח"ל
בית ספר - שחפים
בית ספר - שחקים
בית ספר - שחר
בית ספר - שיזף
בית ספר - שיח' סלמאן אלהוזייל
בית ספר - שייח' חמיס
בית ספר - שילה
בית ספר - שילה
בית ספר - שיפמן
בית ספר - שיפר
בית ספר - שיקומי עומר אבן אל ח'טאב
בית ספר - שיקמים
בית ספר - שיקמים
בית ספר - שירת מושה
בית ספר - שכניה
בית ספר - שלב ג
בית ספר - שלהבת
בית ספר - שלווה
בית ספר - שלום
בית ספר - שלום עליכם
בית ספר - שלמון
בית ספר - שמעוני
בית ספר - שער השמיים
בית ספר - שערי תקווה
בית ספר - שפרינציק
בית ספר - שפרינצק
בית ספר - שפרינצק
בית ספר - שקד
בית ספר - שקד
בית ספר - שקמים
בית ספר - שקמים מעוז
בית ספר - שריד
בית ספר - שרת
בית ספר - ת"ת המסילה
בית ספר - ת"ת חב"ד
בית ספר - תבונת יעקב
בית ספר - תדהר
בית ספר - תהילה
בית ספר - תהילת ישראל
בית ספר - תוחלת
בית ספר - תומר
בית ספר - תומר
בית ספר - תומר לאומניות
בית ספר - תורה ויראה זבחי יצחק בנים
בית ספר - תורה ויראה זבחי צדק בנות
בית ספר - תורה ועבודה
בית ספר - תורה ועבודה
בית ספר - תורני אורות
בית ספר - תורני אסף מימון
בית ספר - תורני ב.ג. צייטלין
בית ספר - תורני חדש
בית ספר - תורני לבנות
בית ספר - תורני לבנות אוהל ציון
בית ספר - תורני לבנות בית יעקוב
בית ספר - תורני לבנות יד אשר
בית ספר - תורני מדעי
בית ספר - תורני מדעי נתיב זבולון
בית ספר - תורני מדעי עציון
בית ספר - תורני נוה חנה
בית ספר - תורני נועם
בית ספר - תורני נעם חדרה
בית ספר - תורני ע"ש הרב עוזיאל
בית ספר - תורני עוז והדר
בית ספר - תורני עקיבא
בית ספר - תורני ראשי ירושלים
בית ספר - תורני רמב"ם
בית ספר - תורנית מדעית
בית ספר - תורת הבית בנים
בית ספר - תורת חיים
בית ספר - תורת חסד
בית ספר - תורת משה
בית ספר - תחכמוני
בית ספר - תחכמוני
בית ספר - תחכמוני
בית ספר - תחכמוני
בית ספר - תחכמוני
בית ספר - תיכון אורט ע"ש גרינברג
בית ספר - תיכון איזורי רמלה לוד
בית ספר - תיכון אלחיאת' חורה
בית ספר - תיכון בית יעקב
בית ספר - תיכון ג'לג'וליה
בית ספר - תיכון לבנים בית צפפא
בית ספר - תיכון למדעים ואומנויות ע"ש שוסטרמן
בית ספר - תיכון למדעים טירה
בית ספר - תיכון למדעים טירה
בית ספר - תיכון מקיף
בית ספר - תיכון מקיף סלאם חדש
בית ספר - תיכון עאהד למדעים
בית ספר - תיכון על שם אברהי
בית ספר - תיכון עמל
בית ספר - תיכון רבין
בית ספר - תיכון שוהם
בית ספר - תיכונית אלישיב
בית ספר - תיכונית צביה
בית ספר - תל חי
בית ספר - תל חי
בית ספר - תל נורדאו
בית ספר - תלמה ילין
בית ספר - תלמוד תורה
בית ספר - תלמוד תורה
בית ספר - תלמוד תורה קהילות יעקב
בית ספר - תלמוד תורה תורת החיים
בית ספר - תלמים
בית ספר - תמיר
בית ספר - תפארת בית ישראל
בית ספר - תפארת בנים
בית ספר - תפארת החיים
בית ספר - תפארת יעקב
בית ספר - תפארת יעקב תיכון טכנולוגי
בית ספר - תפארת משה
בית ספר - תפארת משה סטאלין קרלין
בית ספר - תקוות ציון
בית ספר - תקומה
בית ספר - תרשיחא
בית ספר - תרשיחא
בית ספר - תשב"ר המדרש
בית ספר - תשב"ר המרכזי
בית ספר - תשב"ר הרב
בית ספר - תשב"ר זכרון יעקב
בית ספר - S בי"ס אמריקאי
בית ספר א' - כפר מנדא
בית ספר אום בטין
בית ספר אזורי אפיקי ירדן
בית ספר איל
בית ספר אירוס
בית ספר אל וונטבי
בית ספר אל חנאן
בית ספר אלאמאל לחינוך מיוחד
בית ספר אלי"ע
בית ספר אליקים
בית ספר אלקפזה הטכנולוגי עמל
בית ספר אלרחמה לחינוך מיוחד
בית ספר בבנייה
בית ספר בנות הדסה
בית ספר גל אור
בית ספר גלים
בית ספר האר"י
בית ספר הארצי לעובדי חינוך ונוער
בית ספר הדמוקרטי חווה חקלאית
בית ספר הצורי
בית ספר חט"ב+עליונה - מקיף פרדיס
בית ספר חינוך מיוחד אהל שרה
בית ספר חרדי לבנות - בת מלך
בית ספר טכנולוגי לנוער - כסרא סמיע
בית ספר יסודי - אל עזאזמה ב
בית ספר יסודי - אלגזאלי
בית ספר יסודי - אלחרובה
בית ספר יסודי - אלנאגאה
בית ספר יסודי - אלעזאזמה א
בית ספר יסודי - אלעזאזמה ג
בית ספר יסודי - ג
בית ספר יסודי - מבוא הגליל
בית ספר יסודי א - טורעאן
בית ספר יסודי ב - טורעאן
בית ספר יסודי מ"מ - יצחק שדה
בית ספר יסודי ממ"ד בן עטר
בית ספר יסודי צין
בית ספר יסודי קהילתי - עוזייר
בית ספר כפר דרום
בית ספר לב המושבה
בית ספר לבנות
בית ספר לבנות - הליכות ביתה
בית ספר לבנות - מורשת ירושלים
בית ספר לבנים אריאל
בית ספר לבצלר חינוך מיוחד
בית ספר להנדסאים
בית ספר לחינוך מיוחד
בית ספר לחינוך מיוחד אזהדאא
בית ספר לחינוך מיוחד אלנויר
בית ספר לחינוך מיוחד צוהר לטוהר
בית ספר לחינוך מיוחד רננים
בית ספר למלאכה
בית ספר למקצועות התירות והמלונאות
בית ספר מ"מ אופק חינוך מיוחד
בית ספר מ"מ למדעים מקיף ד
בית ספר מ"מ מקיף ח
בית ספר מ"מ מקיף ט
בית ספר מ"מ נתיב חינוך מיוחד
בית ספר מאיר לארכיאולוגיה
בית ספר מחוננים
בית ספר מיוחד - ממ"ד גולני
בית ספר מיוחד לוטם
בית ספר מיוחד לנוער מוטרד לחן
בית ספר מיוחד מאור
בית ספר מיוחד מנחם בגין
בית ספר מיוחד שפות ותרבויות
בית ספר מיוחד תום גבעתיים
בית ספר ממ"ד - ניצני קטיף
בית ספר ממ"ד - ניצני קטיף
בית ספר ממלכתי דתי - האלה
בית ספר ממלכתי לחינוך מיוחד אבן חן
בית ספר מפתן
בית ספר מקיף א
בית ספר מקיף ג
בית ספר מקיף ג
בית ספר מקיף מ"מ ו
בית ספר מקצועי הולץ
בית ספר משכן
בית ספר נוף ים א
בית ספר נוף ים ב
בית ספר ניצנים
בית ספר נצרת אוטיזם
בית ספר סמינר ויז'ניץ
בית ספר עדיהו
בית ספר עירוני ג
בית ספר עירוני ג
בית ספר עירוני ה
בית ספר עירוני מקיף היובל
בית ספר על יסודי מ"מ מקיף ב
בית ספר על יסודי מקיף ז
בית ספר על"ה לילדים מוגבלים בפעולות
בית ספר עליזה בגין
בית ספר קדימה
בית ספר קהילתי בן צבי
בית ספר קטולי מ"מ סנט ג'וזף
בית ספר רימונים לחינוך מיוחד
בית ספר רננים
בית ספר שדה - אילת
בית ספר שדה - אלון תבור
בית ספר שדה - בקעת הירדן
בית ספר שדה - גולן
בית ספר שדה - גליל תחתון
בית ספר שדה - לטבע וחברה
בית ספר שדה - קשת יונתן
בית עולות מרכז חינוך לבנות
געש מרכז עבודה שיקומי וחינוך מיוחד
דרכי דוד
דרכי דוד
האוניברסיטה - העברית גבעת רם
האוניברסיטה - העברית הר הצופים
האוניברסיטה - העברית ירושלים הפקולטה לחקלאות
האוניברסיטה - העממית המכללה האקדמית- ת"א
האוניברסיטה - הפתוחה
האוניברסיטה - הפתוחה
האוניברסיטה - הפתוחה באר שבע
האוניברסיטה - למחקר ימי
החווה החקלאית להוראת מדעי החקלאות
החווה לחינוך חקלאי
החווה לחינוך חקלאי
היברו יוניון קולג' מכון ללימודי יהדות
הישיבה - הגבוהה תל אביב
הישיבה - טכנולוגית מכון הדס
הישיבה הגבוהה אור עציון
הישיבה התיכונית שעלי תורה
המוסד הבין תחומי הרצליה
המכון - הגיאולוגי משרד תשתיות
המכון - לחקר מערות
המכון האקדמי טכנולוגי חולון
המכינה הקדם צבאית
המכללה - האקדמית אשקלון
המכללה - האקדמית הערבית
המכללה - האקדמית להנדסה בנגב
המכללה - האקדמית להנדסה ירושלים
המכללה - האקדמית להנדסה ע"ש סמי שמעון
המכללה - האקדמית נתניה
המכללה - הטכנולוגית אורט
המכללה - הטכנולוגית ב"ש
המכללה - הטכנולוגית חיל האוויר
המכללה - למינהל
המכללה - למנהל
המכללה - למנהל
המכללה - למנהל ע"ש פולנסקי
המכללה - למנהל קמפוס ת"א
המכללה הקדם צבאית לפיקוד
המרכז האקדמי רופין
המרכז הטכנולוגי להכשרה מקצועית נווה דוד
המרכז הלאומי לחקלאות ימית
המרכז להכשרה טכנולוגית
המרכז לילד
המרכז ללימודי תולדות רעננה
הסדנה החדשה לאומנות
הסמינר הקיבוצי רמת אפעל
הפקולטה למדעי הרוח
הקונסרבטוריון - העירוני למוסיקה
הקריה האקדמית קריית אונו
הקריה החינוכית אורות נריה
הקריה לחינוך תורני חברתי אור תורה
וה
ויצ"ו אחוזת ילדים
חוה לחינוך חקלאי קרית עמל
חווה חקלאית
חווה חקלאית
חווה חקלאית תלמי אברהם
חווה לחינוך חקלאי
חווה לחינוך חקלאי אורות הסביבה ע"ש עלי בן צבי
חווה לחינוך חקלאי ואיכות הסביבה
חווה לחינוך חקלאי ואיכות הסביבה
חווה לחינוך חקלאי וללימודי סביבה
חווה לחינוך חקלאי ע"ש לוי אשכול
חווה לימודית חקלאית
חווה ללימוד הסביבה וחקלאות
חווה למדעי הסביבה והחקלאות
חוות הלימוד
חוות שלומית למדעי החקלאות
חטיבת ביניים - טורעאן
חטיבת ביניים ב - טורעאן
חטיבת ביניים ותיכון - נוג'ידאת
חינוך מיוחד הירדן
חממות ניסוי לחווה חקלאית
חקר דגנים
יחי ראובן
יסודי בנות - אוהל שרה
יסודי ממלכתי אלי כהן
ישיבה
ישיבה
ישיבה
ישיבה
ישיבה - אהבת תורה
ישיבה - אור אלחנן
ישיבה - אור ישראל
ישיבה - אור ישראל
ישיבה - אור תורה סטון
ישיבה - אמרי בינה
ישיבה - אמרי מרדכי
ישיבה - בית יהודה
ישיבה - בית יצחק
ישיבה - בלבב שלם
ישיבה - בני דויד
ישיבה - בני דויד
ישיבה - בני יששכר
ישיבה - בני עקיבא
ישיבה - בני עקיבא
ישיבה - ברית שלום
ישיבה - ברכת אפרים לצעירים
ישיבה - דרך חיים
ישיבה - דרכי חיים
ישיבה - הגדולה ברכת יצחק
ישיבה - הגדולה הקרית ספר
ישיבה - הגדולה נחלת אברהם
ישיבה - ויזיביץ
ישיבה - חדוות התלמוד
ישיבה - חסידי גור
ישיבה - חרדית
ישיבה - טכנולוגית אחוזת יעקב
ישיבה - יסוד המנורה
ישיבה - ישיבה נתיבות לכיש
ישיבה - כנסת יצחק
ישיבה - לב שמחה
ישיבה - לצעירים
ישיבה - לצעירים
ישיבה - לצעירים אלעד
ישיבה - לצעירים דרך התורה
ישיבה - לצעירים שער השמים
ישיבה - מגדל אור
ישיבה - מוסדות המעין בנגב
ישיבה - מכון לציון ברינה
ישיבה - מעלות יהודה
ישיבה - מרכז לחינוך תורני ישיבת זכרון יעקוב
ישיבה - משכן מאיר
ישיבה - נהרגעא מרכז טכנולוגי תורני
ישיבה - נחלת שלמה
ישיבה - נטורת רחל
ישיבה - ע"ש הבן איש חי
ישיבה - ע"ש הרב הנניא שרגא
ישיבה - ע"ש וולפסון
ישיבה - ע"ש פייפא
ישיבה - עין יצחק
ישיבה - צמח צדיק וייז'ניץ
ישיבה - קדושת יום טוב
ישיבה - קרית הישיבה הקדושה
ישיבה - קרית חינוך אור חדש לצעירים
ישיבה - קרית מנחם
ישיבה - שבות ישראל
ישיבה - שער תורה
ישיבה - שערי תורה
ישיבה - תומכי תמימים
ישיבה - תומכי תמימים
ישיבה - תורנית פאר משה
ישיבה - תורת חיים
ישיבה - תורת יוסף קרית שושנה
ישיבה - תיכונית יהודה
ישיבה - תפארת בחורים
ישיבה - תפארת יוחנן
ישיבה לבנים - פרי עץ חיים
ישיבה תיכונית
ישיבת - אביר יעקב
ישיבת - אביר יעקב
ישיבת - אהל מועד
ישיבת - אוהלי מנחם
ישיבת - אופקים תורת חיים
ישיבת - אור דוד
ישיבת - אור דרום
ישיבת - אור יוסף
ישיבת - אור מנחם
ישיבת - אור שמחה
ישיבת - איטרי
ישיבת - אלישיב
ישיבת - אלקבץ
ישיבת - אמרי אמת
ישיבת - אמרי שאול
ישיבת - אמת ושלום
ישיבת - באר התורה
ישיבת - באר יעקוב
ישיבת - באר יצחק
ישיבת - באר יצחק
ישיבת - באר שבע
ישיבת - בית אורות
ישיבת - בית אל
ישיבת - בית אשר
ישיבת - בית הלוי
ישיבת - בית יעקב
ישיבת - בית ספר נחל יצחק
ישיבת - בלז
ישיבת - בנדהיים
ישיבת - בני חיל
ישיבת - בני עקיבא
ישיבת - בני עקיבא
ישיבת - בני עקיבא
ישיבת - בני עקיבא אד"רת
ישיבת - בני עקיבא אוהל שלמה
ישיבת - בני עקיבא בית שמואל
ישיבת - בני עקיבא יד אברהם
ישיבת - בני עקיבא מירון
ישיבת - בני עקיבא נר תמיד
ישיבת - בניין אב
ישיבת - בר אילן
ישיבת - ברכת יוסף
ישיבת - ברסלב האר"י הספרדי
ישיבת - דברי חיים
ישיבת - דרום
ישיבת - דרכי יוסף
ישיבת - דרכי נעם
ישיבת - האר"י הקדוש זיע"א
ישיבת - ההסדר נתיבות
ישיבת - ההסדר קרית שמונה
ישיבת - ההסדר ראשל"צ
ישיבת - היכל התורה
ישיבת - היכל התורה
ישיבת - הסדר אפיקי דעת
ישיבת - הסדר הגולן
ישיבת - הסדר מעלה אפריים
ישיבת - הסדר ניר
ישיבת - הסדר קרית גת
ישיבת - ויזניץ
ישיבת - ויזניץ
ישיבת - חב"ד בית אוהל מנחם
ישיבת - חברון כנסת ישראל
ישיבת - חזון נחום
ישיבת - חכמי לובלין
ישיבת - חכמת שלמה
ישיבת - חניכי קול תורה
ישיבת - חסידי צאנז
ישיבת - חפץ חיים
ישיבת - טבריה אור אלחנן
ישיבת - כנסת הגדולה קרית ספר
ישיבת - כנסת חזקיהו
ישיבת - כנסת יצחק
ישיבת - כסא רחמים
ישיבת - כרמי אל
ישיבת - לב לדעת
ישיבת - לומזה
ישיבת - מאור התלמוד
ישיבת - מור
ישיבת - מור
ישיבת - מי התורה
ישיבת - מיר מודיעין עילית
ישיבת - מעלות ראי"ה
ישיבת - מערבא מכון רובין
ישיבת - משכן יעקב
ישיבת - נוה ארץ
ישיבת - נוה ירושלים לבנות
ישיבת - נחלת אשקלון
ישיבת - נחלת דוד הגדולה
ישיבת - נחלת מאיר
ישיבת - נחלת שמואל
ישיבת - נר ישראל
ישיבת - נר משה
ישיבת - נתיב השבים
ישיבת - עטרת יצחק
ישיבת - עטרת מרדכי
ישיבת - עמליה
ישיבת - פרחי אהרון
ישיבת - פרמישלאן
ישיבת - פרשבורג
ישיבת - צאנז
ישיבת - צביה קטיף
ישיבת - צעירי השלוחים ע"ש מש' כהן
ישיבת - קול יהודה
ישיבת - קול יעקב
ישיבת - קידושי הרים
ישיבת - קריית שלום
ישיבת - קרלין
ישיבת - קרלין סטולין
ישיבת - ראדין
ישיבת - שדרות
ישיבת - שערי ציון
ישיבת - שערי שמים
ישיבת - תומכי תמימים
ישיבת - תורת אור
ישיבת - תורת אמת חב"ד
ישיבת - תלמוד תורה
ישיבת - תפארת משה בצלאל
ישיבת אורחות חיים
ישיבת באר החכמה
ישיבת הסדר דימונה
כולל - חסידי
כולל - לבנות
כולל - ס.פאולא
כולל - עטרת משה
כולל - פוניבז
כולל - תפארת רחמים
כפר הילדים מגדים אס.א.אס
כפר הנוער מנו"פ
כפר השיקומי
כפר ילדים אשלים
כפר ילדים עפולה עלית
כפר עידוד מוסד למוגבלים
כפר רפאל קהילה שיקומית
מ.ש.כ.ל מרכז שיפור כשרי למידה
מאיר סיגלס מחקר זואולוגי
מדרשה למנהיגות חברתית
מדרשת הנגב
מוסד דתי חינוכי רמת המגשימים
מוסד חינוך אריאל שרון
מוסד חינוך בית ספר למלאכה
מוסד חינוך טמפלרי
מוסד חינוך מיוחד כפר נחמן
מוסד חינוך מכון רותי
מוסד לחינוך מיוחד אור
מוסד לחינוך מיוחד יובלים
מוסד עדן לילדים פגועים
מוסד שערי ציון
מוסדות ברסלב
מוסדות היכל דוד אשקלון של ש"ס
מוסדות התורה בית ישראל
מוסדות חמדת נר ישראל
מוסדות חסידי בעלז
מוסדות קרעטשניץ
מוסדות שערי קדושה
מועדון נוער
מועצת הנוער העירוני
מכון - בן צבי
מכון - וולקני
מכון - וטרינרי
מכון - יד לזהבה מכון חברות נאוה
מכון - ישראלי לסיבים
מכון - להנדסה חקלאית
מכון - למחקרים מתקדמים
מכון - שלום הארטמן
מכון בית יעקב למורות
מכון גרוס ישיבה אוניברסיטאית
מכון התקנים - אתר רופין
מכון וייצמן למדע
מכון טכנולוגי ויצו
מכון למורים צעירים תלמוד תורה
מכון לנוער מצפה ים
מכון צומת למדע ותורה
מכינה ישיבתית קדם צבאית אלישע
מכינה קדם צבאי
מכינה קדם צבאית קשת יהודה
מכללה - אזורית לוד
מכללה - אקדמית דתית ליפשיץ
מכללה - אקדמית תל אביב יפו
מכללה - בית ספר טיכנולוגי
מכללה - גבעת חביבה
מכללה - האקדמית יהודה ושומרון
מכללה - האקדמית יהודה ושומרון
מכללה - טיכנולוגית יעד
מכללה - טכנולוגית אורט טכניקום
מכללה - טכנולוגית אמי"ת
מכללה - טכנולוגית חיפה עמל
מכללה - טכנולוגית לבנייה
מכללה - לאחיות הסלוואטוריות
מכללה - לבנות ע"ש שמידט
מכללה - לחינוך טכנולוגי
מכללה - למנהל
מכללה - למנהל אילת
מכללה - מכון וינגייט
מכללה - מכללת פתח תקווה
מכללה - מכללת שאנן
מכללה - ספיר
מכללה - עמל 1
מכללה - רב תחומית
מכללת - אוהלו
מכללת - אורות
מכללת - אורט בראודה
מכללת - אורט רחובות
מכללת - אחוה
מכללת - אל קאסמי
מכללת - אמונה
מכללת - אתגר
מכללת - בת ים האוניברסיטה הפתוחה
מכללת - הגליל המערבי
מכללת - הדסה
מכללת - המשטרה
מכללת - יד חרוצים
מכללת - יעקוב הרצוג
מכללת - ירושלים לבנות
מכללת - לוינסקי לחינוך
מכללת - נצרת עילית
מכללת - סכנין להכשרת מורים
מכללת - עמל
מכללת - עמל למבוגרים
מכללת - עמל ע"ש ליידי דיוויס
מכללת - עתיד
מכללת - צפת
מכללת - קיי
מכללת - קמפוס חנקין
מכללת - רדיו דרום
מכללת - רמת גן
מכללת - רעננה
מכללת - שנקר
מכללת - שעלבים
מכללת - שערי משפט
מכללת - תל אביב
מכללת - תל חי
מכללת אורנים
מעון - מצפה יריחו
מעון - קרית האמנים
מעון גני טל
מעון ט"ל לימן
מעון יום - ענבל
מעון יום אמונה
מעון נווה כנרת
מעון רמת טבריה
מעונות מכללה - האקדמית עמק יזראל
מעיין החינוך התורני גן הדסה
מעיינות מוסד ללימודי יהדות
מקיף אורט אפרידר רונסון חטיבת אשקלון
מקיף אורט ע"ש הנרי רונסון
מקיף השלום ע"ש יצחק רבין
מקיף י"א ע"ש רבין
מקיף מ"מ יצחק רבין
מקיף מ"מ מנחם בגין
מקיף מ"מ ע"ש זינמן
מקיף מ"מ ע"ש יגאל אלון
מקיף מ"מ עירוני א
מקיף מ"מ עירוני גולדווטר
מקיף ממ"ד ע"ש הלל אפלמן
מרכז הברכה סמינר מורים
מרכז הדרכה אזורי חוף אשקלון
מרכז הדרכה ארצי קופ"ח כללית
מרכז הדרכה לשדה
מרכז החינוך העצמאי מסורת אבות
מרכז הנוער הרב התחומי מגדלות השומר הצעיר
מרכז זיסמן לכבדי שמיעה
מרכז חינוך דתי טללי חיים
מרכז חינוך העצמאי מסורת ישראל
מרכז חינוך טיפולי גנאור
מרכז חינוך ימי
מרכז חינוך עירוני
מרכז חינוך תורני חרדי
מרכז חינוכי בגליל לבנות אור חדש
מרכז חינוכי ברנקו וייס
מרכז חינוכי טיפולי לליקויי למידה והסתגלות
מרכז חינוכי שיקומי עין כרם
מרכז חינוכי תורני קילא
מרכז להכשרה קדם צבאית
מרכז לילדים נפגעים בי"ס מגן
מרכז לימודי ישראל יפה
מרכז מאיר אבחון וטיפול בליקויי למידה
מרכז מחשבים בל"ל
מרכז נוער רב תכליתי
מרכז ספורט אוניברסיטת בן גוריון
מרכז פסג"ה
מרכז קידום למידה
מרכז רב תחומי
מרכז תורה
מרכז תורני חינוכי נצח ישראל
משרד העבודה מעון אחווה
משרד העבודה מעון עתידות
נווה חורש לילדים טעוני טיפוח
נופי ארבל
סית ספר מקיף - אלבטוף
סמינר - כלל חסידי
סמינר באר יעקוב ע"ש שמואל ופני וולפסון
סמינר בית יעקב
סמינר בית יעקב
סמינר בית יעקב הרב כהנא
סמינר בית יעקב למורות וגננות - נתיבות חכמה
סמינר הקיבוצים
סמינר חסידי קרעטשניף
סמינר לבנות בית אלקיים
סמינר לבנות מורשת דליה
סמינר למורות בית יעקב
סמינר תיכון בית יעקב החדש
עין טל מחקר לפתוח חקלאי
עמיתים טכנולוגיה והכשרה ימית
עץ הדעת
ערוגות רבקה חווה חקלאית
פיס
פל ים וכנרת
פנימיה - אבנת
פנימיה - אורט ליבוביץ' נתניה
פנימיה - אחוזת שרה
פנימיה - אלווין מרכז ע"ש צבי קווישטמן
פנימיה - אמי"ת ממ"ד כפר בתיה
פנימיה - בית הילדים
פנימיה - בית טף
פנימיה - בית ילדים נווה גלים
פנימיה - בית ספר תורני נעם
פנימיה - בלבב שלם
פנימיה - בלבב שלם
פנימיה - בנות אור החיים
פנימיה - דתית לבנות
פנימיה - הכפר הירוק
פנימיה - חוות הנוער ע"ש ישראל גולדשטיין
פנימיה - ימין אורד
פנימיה - ישיבת ההסדר
פנימיה - כדורי
פנימיה - כפר הילדים ע"ש אפל
פנימיה - כפר הנוער הדסים ויצו קנדה
פנימיה - כפר הנוער מוסינזון
פנימיה - כפר לי פנימייה חינוכית
פנימיה - כפר נוער אונים
פנימיה - כפר נוער הדסה נעורים
פנימיה - כפר נוער הודיות
פנימיה - כפר נוער הימי מבואות ים
פנימיה - כפר נוער רזיאל
פנימיה - כפר נוערכפר הנוער הדתי בן יקיר הסוכנות ה*
פנימיה - כפר נרדים
פנימיה - כפר עלומים
פנימיה - לאומנויות
פנימיה - לבנות
פנימיה - לילדים עוגן
פנימיה - לסטודנטים
פנימיה - לשיקום נוער ערבי
פנימיה - מוסד בית בר דרור
פנימיה - מעון רוחמה לטיפול במפגרים
פנימיה - נוה חנה
פנימיה - נווה הדר
פנימיה - נווה מיכאל כפר ילדים ונוער
פנימיה - נווה נטוע מוסד לילדים טעוני טיפוח
פנימיה - נעמ"ת
פנימיה - נתיב אור
פנימיה - סלאם בנגב
פנימיה - עדנים
פנימיה - פנמית כפר ילדים תלפיות
פנימיה - קריתת משה
פנימיה - שטיינברג
פנימיה - תיכון תורה ומקצוע
פנימיית - בויאר
פנימיית - בית סקנדינביה
פנימיית - בני ברית
פנימיית - כרמית
פנימיית - נווה יהודה
פנימיית כפר הילדים
פנימיית רננים
פנימית - חב"ד
פנימית - ניר העמק
פנימית - שדה חמד
פסגה המרכז לפיתוח סיגלי הוראה
פסגה מרכז לפיתוח סגל הוראה
קונסרבטוריון - עירוני
קריה חינוכית חורב
קריית הטכניון
קריית חינוך בתי ספר אילון מורה
קריית חינוך ע"ש דוד בן גוריון
קרית אוניברסיטת בן גוריון ע"ש א.ברגמן
קרית אוניברסיטת בן גוריון ע"ש דוד טוביה
קרית החינוך הדתית אמי"ת
קרית חינוך אורט שומרון
קרית חינוך בן גוריון
קרית חינוך ברטה וסלומון כהן
קרית חינוך גבעת מיכאל
קרית חינוך גליל מערבי מעלות
קרית חינוך זבולון המר
קרית חינוך ירדן
קרית חינוך כוכב יאיר
קרית חינוך לבנות ע"ש גפונדא וטיטלבוים
קרית חינוך לחיילי צה"ל
קרית חינוך ע"ש יצחק רבין
קרית חינוך ע"ש רבין
קרית חינוך עתידים
קרית חינוך קול המבשר
קרית חינוך שדות נגב
קרית מדע וטכנולוגיה
קרית מוריה המדרשה למורים בגולה
רמים מעון לילדים מוגבלים
רקפות בית ספר לבנות
שיקום מקצועי elvin קבוצת צומת
שלוחה רופין
ת"ת גני שלהבת
תיכון - אור
תיכון - טכנולוגי טורעאן
תיכון - על שם אילן ואסף רמון
תיכון אורט
תיכון בית ירח
תיכון בנות - בית יעקב
תיכון חינוך מיוחד דון גאנטלה של האב הוגו
תיכון מ"מ חדש ע"ש א' ליהמן
תיכון מקיף - קרית האמנים
תיכון מקצועי מ"מ מפתן דימונה
תיכון עמל שכונה 11
תל"ם תיכון של המכללה למינהל
תפארת מורדכאי שלמה היכל משה
AIS בי"ס אמריקאי בינלאומי
'''


def iterate_education_institutes():
    for e in EDUCATION_INSTITUTES.split('\n'):
        if e and e.strip():
            e = e.strip()
            for t in [
                'בית ספר -',
                'תיכון -',
                'פנימיית -',
                'פנימיה -',
            ]:
                if len(e) >= 10:
                    e = e.replace(t, '').strip()
            if len(e) >= 12:
                yield e.strip()


@lru_cache()
def get_education_institues_set():
    return set(iterate_education_institutes())


if __name__ == '__main__':
    for e in get_education_institues_set():
        print(e)
